module ToyFourierFunctions
f(t::Float64, Ωr::Float64, Ωθ::Float64, Ωϕ::Float64)=-0.01 - 0.23*cos(t*Ωr) + 0.58*cos(2*t*Ωr) - 1.09*cos(3*t*Ωr) - 0.05*cos(t*Ωθ) + 
0.1*cos(2*t*Ωθ) + 0.16*cos(3*t*Ωθ) + 0.28*cos(t*(Ωr + Ωθ)) + 
0.64*cos(t*(2*Ωr + Ωθ)) + 1.16*cos(t*(3*Ωr + Ωθ)) + 0.34*cos(t*(Ωr + 2*Ωθ)) - 
0.71*cos(t*(2*Ωr + 2*Ωθ)) + 1.24*cos(t*(3*Ωr + 2*Ωθ)) - 
0.41000000000000003*cos(t*(Ωr + 3*Ωθ)) - 0.79*cos(t*(2*Ωr + 3*Ωθ)) - 
1.33*cos(t*(3*Ωr + 3*Ωθ)) - 0.49*cos(t*(Ωr + 4*Ωθ)) + 
0.88*cos(t*(2*Ωr + 4*Ωθ)) - 1.43*cos(t*(3*Ωr + 4*Ωθ)) + 
0.98*cos(t*(2*Ωr + 5*Ωθ)) + 1.54*cos(t*(3*Ωr + 5*Ωθ)) + 
1.6600000000000001*cos(t*(3*Ωr + 6*Ωθ)) + 0.02*cos(t*Ωϕ) - 0.03*cos(2*t*Ωϕ) + 
0.04*cos(3*t*Ωϕ) + 0.24*cos(t*(Ωr + Ωϕ)) - 0.59*cos(t*(2*Ωr + Ωϕ)) + 
1.1*cos(t*(3*Ωr + Ωϕ)) + 0.06*cos(t*(Ωθ + Ωϕ)) - 0.29*cos(t*(Ωr + Ωθ + Ωϕ)) - 
0.65*cos(t*(2*Ωr + Ωθ + Ωϕ)) - 1.17*cos(t*(3*Ωr + Ωθ + Ωϕ)) - 
0.11*cos(t*(2*Ωθ + Ωϕ)) - 0.35000000000000003*cos(t*(Ωr + 2*Ωθ + Ωϕ)) + 
0.72*cos(t*(2*Ωr + 2*Ωθ + Ωϕ)) - 1.25*cos(t*(3*Ωr + 2*Ωθ + Ωϕ)) - 
0.17*cos(t*(3*Ωθ + Ωϕ)) + 0.42*cos(t*(Ωr + 3*Ωθ + Ωϕ)) + 
0.8*cos(t*(2*Ωr + 3*Ωθ + Ωϕ)) + 1.34*cos(t*(3*Ωr + 3*Ωθ + Ωϕ)) + 
0.5*cos(t*(Ωr + 4*Ωθ + Ωϕ)) - 0.89*cos(t*(2*Ωr + 4*Ωθ + Ωϕ)) + 
1.44*cos(t*(3*Ωr + 4*Ωθ + Ωϕ)) - 0.99*cos(t*(2*Ωr + 5*Ωθ + Ωϕ)) - 
1.55*cos(t*(3*Ωr + 5*Ωθ + Ωϕ)) - 1.67*cos(t*(3*Ωr + 6*Ωθ + Ωϕ)) - 
0.25*cos(t*(Ωr + 2*Ωϕ)) + 0.6*cos(t*(2*Ωr + 2*Ωϕ)) - 1.11*cos(t*(3*Ωr + 2*Ωϕ)) - 
0.07*cos(t*(Ωθ + 2*Ωϕ)) + 0.3*cos(t*(Ωr + Ωθ + 2*Ωϕ)) + 
0.66*cos(t*(2*Ωr + Ωθ + 2*Ωϕ)) + 1.18*cos(t*(3*Ωr + Ωθ + 2*Ωϕ)) + 
0.12*cos(t*(2*Ωθ + 2*Ωϕ)) + 0.36*cos(t*(Ωr + 2*Ωθ + 2*Ωϕ)) - 
0.73*cos(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) + 1.26*cos(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) + 
0.18*cos(t*(3*Ωθ + 2*Ωϕ)) - 0.43*cos(t*(Ωr + 3*Ωθ + 2*Ωϕ)) - 
0.81*cos(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) - 1.35*cos(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) - 
0.51*cos(t*(Ωr + 4*Ωθ + 2*Ωϕ)) + 0.9*cos(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) - 
1.45*cos(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) + 1.0*cos(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) + 
1.56*cos(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) + 1.68*cos(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) + 
0.26*cos(t*(Ωr + 3*Ωϕ)) - 0.61*cos(t*(2*Ωr + 3*Ωϕ)) + 
1.12*cos(t*(3*Ωr + 3*Ωϕ)) + 0.08*cos(t*(Ωθ + 3*Ωϕ)) - 
0.31*cos(t*(Ωr + Ωθ + 3*Ωϕ)) - 0.67*cos(t*(2*Ωr + Ωθ + 3*Ωϕ)) - 
1.19*cos(t*(3*Ωr + Ωθ + 3*Ωϕ)) - 0.13*cos(t*(2*Ωθ + 3*Ωϕ)) - 
0.37*cos(t*(Ωr + 2*Ωθ + 3*Ωϕ)) + 0.74*cos(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) - 
1.27*cos(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) - 0.19*cos(t*(3*Ωθ + 3*Ωϕ)) + 
0.44*cos(t*(Ωr + 3*Ωθ + 3*Ωϕ)) + 
0.8200000000000001*cos(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) + 
1.36*cos(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) + 0.52*cos(t*(Ωr + 4*Ωθ + 3*Ωϕ)) - 
0.91*cos(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) + 1.46*cos(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) - 
1.01*cos(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) - 1.57*cos(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) - 
1.69*cos(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) - 0.27*cos(t*(Ωr + 4*Ωϕ)) + 
0.62*cos(t*(2*Ωr + 4*Ωϕ)) - 1.1300000000000001*cos(t*(3*Ωr + 4*Ωϕ)) - 
0.09*cos(t*(Ωθ + 4*Ωϕ)) + 0.32*cos(t*(Ωr + Ωθ + 4*Ωϕ)) + 
0.68*cos(t*(2*Ωr + Ωθ + 4*Ωϕ)) + 1.2*cos(t*(3*Ωr + Ωθ + 4*Ωϕ)) + 
0.14*cos(t*(2*Ωθ + 4*Ωϕ)) + 0.38*cos(t*(Ωr + 2*Ωθ + 4*Ωϕ)) - 
0.75*cos(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) + 1.28*cos(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) + 
0.2*cos(t*(3*Ωθ + 4*Ωϕ)) - 0.45*cos(t*(Ωr + 3*Ωθ + 4*Ωϕ)) - 
0.8300000000000001*cos(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) - 
1.37*cos(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) - 0.53*cos(t*(Ωr + 4*Ωθ + 4*Ωϕ)) + 
0.92*cos(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) - 1.47*cos(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) + 
1.02*cos(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) + 1.58*cos(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) + 
1.7*cos(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) - 0.63*cos(t*(2*Ωr + 5*Ωϕ)) + 
1.1400000000000001*cos(t*(3*Ωr + 5*Ωϕ)) - 0.33*cos(t*(Ωr + Ωθ + 5*Ωϕ)) - 
0.6900000000000001*cos(t*(2*Ωr + Ωθ + 5*Ωϕ)) - 1.21*cos(t*(3*Ωr + Ωθ + 5*Ωϕ)) - 
0.15*cos(t*(2*Ωθ + 5*Ωϕ)) - 0.39*cos(t*(Ωr + 2*Ωθ + 5*Ωϕ)) + 
0.76*cos(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) - 1.29*cos(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) - 
0.21*cos(t*(3*Ωθ + 5*Ωϕ)) + 0.46*cos(t*(Ωr + 3*Ωθ + 5*Ωϕ)) + 
0.84*cos(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) + 
1.3800000000000001*cos(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) + 
0.54*cos(t*(Ωr + 4*Ωθ + 5*Ωϕ)) - 0.93*cos(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) + 
1.48*cos(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) - 1.03*cos(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) - 
1.59*cos(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) - 1.71*cos(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) - 
1.1500000000000001*cos(t*(3*Ωr + 6*Ωϕ)) + 
0.7000000000000001*cos(t*(2*Ωr + Ωθ + 6*Ωϕ)) + 1.22*cos(t*(3*Ωr + Ωθ + 6*Ωϕ)) + 
0.4*cos(t*(Ωr + 2*Ωθ + 6*Ωϕ)) - 0.77*cos(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) + 
1.3*cos(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) + 0.22*cos(t*(3*Ωθ + 6*Ωϕ)) - 
0.47000000000000003*cos(t*(Ωr + 3*Ωθ + 6*Ωϕ)) - 
0.85*cos(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) - 
1.3900000000000001*cos(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) - 
0.55*cos(t*(Ωr + 4*Ωθ + 6*Ωϕ)) + 
0.9400000000000001*cos(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) - 
1.49*cos(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) + 1.04*cos(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) + 
1.6*cos(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) + 1.72*cos(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) - 
1.23*cos(t*(3*Ωr + Ωθ + 7*Ωϕ)) + 0.78*cos(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) - 
1.31*cos(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) + 0.48*cos(t*(Ωr + 3*Ωθ + 7*Ωϕ)) + 
0.86*cos(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) + 
1.4000000000000001*cos(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) + 
0.56*cos(t*(Ωr + 4*Ωθ + 7*Ωϕ)) - 
0.9500000000000001*cos(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) + 
1.5*cos(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) - 1.05*cos(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) - 
1.61*cos(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) - 1.73*cos(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) + 
1.32*cos(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) - 0.87*cos(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) - 
1.41*cos(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) - 
0.5700000000000001*cos(t*(Ωr + 4*Ωθ + 8*Ωϕ)) + 
0.96*cos(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) - 1.51*cos(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) + 
1.06*cos(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) + 1.62*cos(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) + 
1.74*cos(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) + 1.42*cos(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) - 
0.97*cos(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) + 1.52*cos(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) - 
1.07*cos(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) - 
1.6300000000000001*cos(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) - 
1.75*cos(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) - 1.53*cos(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) + 
1.08*cos(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) + 
1.6400000000000001*cos(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) + 
1.76*cos(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) - 
1.6500000000000001*cos(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) - 
1.77*cos(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) + 1.78*cos(t*(3*Ωr + 6*Ωθ + 12*Ωϕ)) - 
2.0100000000000002*sin(t*Ωr) + 2.36*sin(2*t*Ωr) - 2.87*sin(3*t*Ωr) - 
1.83*sin(t*Ωθ) + 1.8800000000000001*sin(2*t*Ωθ) + 1.94*sin(3*t*Ωθ) + 
2.06*sin(t*(Ωr + Ωθ)) + 2.42*sin(t*(2*Ωr + Ωθ)) + 2.94*sin(t*(3*Ωr + Ωθ)) + 
2.12*sin(t*(Ωr + 2*Ωθ)) - 2.49*sin(t*(2*Ωr + 2*Ωθ)) + 
3.02*sin(t*(3*Ωr + 2*Ωθ)) - 2.19*sin(t*(Ωr + 3*Ωθ)) - 
2.57*sin(t*(2*Ωr + 3*Ωθ)) - 3.11*sin(t*(3*Ωr + 3*Ωθ)) - 
2.27*sin(t*(Ωr + 4*Ωθ)) + 2.66*sin(t*(2*Ωr + 4*Ωθ)) - 
3.21*sin(t*(3*Ωr + 4*Ωθ)) + 2.7600000000000002*sin(t*(2*Ωr + 5*Ωθ)) + 
3.3200000000000003*sin(t*(3*Ωr + 5*Ωθ)) + 3.44*sin(t*(3*Ωr + 6*Ωθ)) + 
1.8*sin(t*Ωϕ) - 1.81*sin(2*t*Ωϕ) + 1.82*sin(3*t*Ωϕ) + 2.02*sin(t*(Ωr + Ωϕ)) - 
2.37*sin(t*(2*Ωr + Ωϕ)) + 2.88*sin(t*(3*Ωr + Ωϕ)) + 1.84*sin(t*(Ωθ + Ωϕ)) - 
2.07*sin(t*(Ωr + Ωθ + Ωϕ)) - 2.43*sin(t*(2*Ωr + Ωθ + Ωϕ)) - 
2.95*sin(t*(3*Ωr + Ωθ + Ωϕ)) - 1.8900000000000001*sin(t*(2*Ωθ + Ωϕ)) - 
2.13*sin(t*(Ωr + 2*Ωθ + Ωϕ)) + 2.5*sin(t*(2*Ωr + 2*Ωθ + Ωϕ)) - 
3.0300000000000002*sin(t*(3*Ωr + 2*Ωθ + Ωϕ)) - 1.95*sin(t*(3*Ωθ + Ωϕ)) + 
2.2*sin(t*(Ωr + 3*Ωθ + Ωϕ)) + 2.58*sin(t*(2*Ωr + 3*Ωθ + Ωϕ)) + 
3.12*sin(t*(3*Ωr + 3*Ωθ + Ωϕ)) + 2.2800000000000002*sin(t*(Ωr + 4*Ωθ + Ωϕ)) - 
2.67*sin(t*(2*Ωr + 4*Ωθ + Ωϕ)) + 3.22*sin(t*(3*Ωr + 4*Ωθ + Ωϕ)) - 
2.77*sin(t*(2*Ωr + 5*Ωθ + Ωϕ)) - 3.33*sin(t*(3*Ωr + 5*Ωθ + Ωϕ)) - 
3.45*sin(t*(3*Ωr + 6*Ωθ + Ωϕ)) - 2.0300000000000002*sin(t*(Ωr + 2*Ωϕ)) + 
2.38*sin(t*(2*Ωr + 2*Ωϕ)) - 2.89*sin(t*(3*Ωr + 2*Ωϕ)) - 
1.85*sin(t*(Ωθ + 2*Ωϕ)) + 2.08*sin(t*(Ωr + Ωθ + 2*Ωϕ)) + 
2.44*sin(t*(2*Ωr + Ωθ + 2*Ωϕ)) + 2.96*sin(t*(3*Ωr + Ωθ + 2*Ωϕ)) + 
1.9000000000000001*sin(t*(2*Ωθ + 2*Ωϕ)) + 2.14*sin(t*(Ωr + 2*Ωθ + 2*Ωϕ)) - 
2.5100000000000002*sin(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) + 
3.04*sin(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) + 1.96*sin(t*(3*Ωθ + 2*Ωϕ)) - 
2.21*sin(t*(Ωr + 3*Ωθ + 2*Ωϕ)) - 2.59*sin(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) - 
3.13*sin(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) - 2.29*sin(t*(Ωr + 4*Ωθ + 2*Ωϕ)) + 
2.68*sin(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) - 3.23*sin(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) + 
2.7800000000000002*sin(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) + 
3.34*sin(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) + 3.46*sin(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) + 
2.04*sin(t*(Ωr + 3*Ωϕ)) - 2.39*sin(t*(2*Ωr + 3*Ωϕ)) + 2.9*sin(t*(3*Ωr + 3*Ωϕ)) + 
1.86*sin(t*(Ωθ + 3*Ωϕ)) - 2.09*sin(t*(Ωr + Ωθ + 3*Ωϕ)) - 
2.45*sin(t*(2*Ωr + Ωθ + 3*Ωϕ)) - 2.97*sin(t*(3*Ωr + Ωθ + 3*Ωϕ)) - 
1.9100000000000001*sin(t*(2*Ωθ + 3*Ωϕ)) - 2.15*sin(t*(Ωr + 2*Ωθ + 3*Ωϕ)) + 
2.52*sin(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) - 
3.0500000000000003*sin(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) - 1.97*sin(t*(3*Ωθ + 3*Ωϕ)) + 
2.22*sin(t*(Ωr + 3*Ωθ + 3*Ωϕ)) + 2.6*sin(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) + 
3.14*sin(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) + 
2.3000000000000003*sin(t*(Ωr + 4*Ωθ + 3*Ωϕ)) - 
2.69*sin(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) + 3.24*sin(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) - 
2.79*sin(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) - 3.35*sin(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) - 
3.47*sin(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) - 2.05*sin(t*(Ωr + 4*Ωϕ)) + 
2.4*sin(t*(2*Ωr + 4*Ωϕ)) - 2.91*sin(t*(3*Ωr + 4*Ωϕ)) - 1.87*sin(t*(Ωθ + 4*Ωϕ)) + 
2.1*sin(t*(Ωr + Ωθ + 4*Ωϕ)) + 2.46*sin(t*(2*Ωr + Ωθ + 4*Ωϕ)) + 
2.98*sin(t*(3*Ωr + Ωθ + 4*Ωϕ)) + 1.92*sin(t*(2*Ωθ + 4*Ωϕ)) + 
2.16*sin(t*(Ωr + 2*Ωθ + 4*Ωϕ)) - 
2.5300000000000002*sin(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) + 
3.06*sin(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) + 1.98*sin(t*(3*Ωθ + 4*Ωϕ)) - 
2.23*sin(t*(Ωr + 3*Ωθ + 4*Ωϕ)) - 2.61*sin(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) - 
3.15*sin(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) - 2.31*sin(t*(Ωr + 4*Ωθ + 4*Ωϕ)) + 
2.7*sin(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) - 3.25*sin(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) + 
2.8000000000000003*sin(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) + 
3.36*sin(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) + 3.48*sin(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) - 
2.41*sin(t*(2*Ωr + 5*Ωϕ)) + 2.92*sin(t*(3*Ωr + 5*Ωϕ)) - 
2.11*sin(t*(Ωr + Ωθ + 5*Ωϕ)) - 2.47*sin(t*(2*Ωr + Ωθ + 5*Ωϕ)) - 
2.99*sin(t*(3*Ωr + Ωθ + 5*Ωϕ)) - 1.93*sin(t*(2*Ωθ + 5*Ωϕ)) - 
2.17*sin(t*(Ωr + 2*Ωθ + 5*Ωϕ)) + 2.54*sin(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) - 
3.0700000000000003*sin(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) - 1.99*sin(t*(3*Ωθ + 5*Ωϕ)) + 
2.24*sin(t*(Ωr + 3*Ωθ + 5*Ωϕ)) + 2.62*sin(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) + 
3.16*sin(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) + 2.32*sin(t*(Ωr + 4*Ωθ + 5*Ωϕ)) - 
2.71*sin(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) + 
3.2600000000000002*sin(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) - 
2.81*sin(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) - 3.37*sin(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) - 
3.49*sin(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) - 2.93*sin(t*(3*Ωr + 6*Ωϕ)) + 
2.48*sin(t*(2*Ωr + Ωθ + 6*Ωϕ)) + 3.0*sin(t*(3*Ωr + Ωθ + 6*Ωϕ)) + 
2.18*sin(t*(Ωr + 2*Ωθ + 6*Ωϕ)) - 
2.5500000000000003*sin(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) + 
3.08*sin(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) + 2.0*sin(t*(3*Ωθ + 6*Ωϕ)) - 
2.25*sin(t*(Ωr + 3*Ωθ + 6*Ωϕ)) - 2.63*sin(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) - 
3.17*sin(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) - 2.33*sin(t*(Ωr + 4*Ωθ + 6*Ωϕ)) + 
2.72*sin(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) - 3.27*sin(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) + 
2.82*sin(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) + 3.38*sin(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) + 
3.5*sin(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) - 3.0100000000000002*sin(t*(3*Ωr + Ωθ + 7*Ωϕ)) + 
2.56*sin(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) - 3.09*sin(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) + 
2.2600000000000002*sin(t*(Ωr + 3*Ωθ + 7*Ωϕ)) + 
2.64*sin(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) + 3.18*sin(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) + 
2.34*sin(t*(Ωr + 4*Ωθ + 7*Ωϕ)) - 2.73*sin(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) + 
3.2800000000000002*sin(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) - 
2.83*sin(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) - 3.39*sin(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) - 
3.5100000000000002*sin(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) + 
3.1*sin(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) - 2.65*sin(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) - 
3.19*sin(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) - 2.35*sin(t*(Ωr + 4*Ωθ + 8*Ωϕ)) + 
2.74*sin(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) - 3.29*sin(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) + 
2.84*sin(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) + 3.4*sin(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) + 
3.52*sin(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) + 3.2*sin(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) - 
2.75*sin(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) + 
3.3000000000000003*sin(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) - 
2.85*sin(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) - 3.41*sin(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) - 
3.5300000000000002*sin(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) - 
3.31*sin(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) + 2.86*sin(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) + 
3.42*sin(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) + 3.54*sin(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) - 
3.43*sin(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) - 
3.5500000000000003*sin(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) + 
3.56*sin(t*(3*Ωr + 6*Ωθ + 12*Ωϕ))

f2(t::Float64, Ωr::Float64, Ωθ::Float64, Ωϕ::Float64)=        0.23*Ωr^2*cos(t*Ωr) - 2.32*Ωr^2*cos(2*t*Ωr) + 9.81*Ωr^2*cos(3*t*Ωr) + 
0.05*Ωθ^2*cos(t*Ωθ) - 0.4*Ωθ^2*cos(2*t*Ωθ) - 1.44*Ωθ^2*cos(3*t*Ωθ) - 
0.28*(Ωr + Ωθ)^2*cos(t*(Ωr + Ωθ)) - 0.64*(2*Ωr + Ωθ)^2*cos(t*(2*Ωr + Ωθ)) - 
1.16*(3*Ωr + Ωθ)^2*cos(t*(3*Ωr + Ωθ)) - 
0.34*(Ωr + 2*Ωθ)^2*cos(t*(Ωr + 2*Ωθ)) + 
0.71*(2*Ωr + 2*Ωθ)^2*cos(t*(2*Ωr + 2*Ωθ)) - 
1.24*(3*Ωr + 2*Ωθ)^2*cos(t*(3*Ωr + 2*Ωθ)) + 
0.41000000000000003*(Ωr + 3*Ωθ)^2*cos(t*(Ωr + 3*Ωθ)) + 
0.79*(2*Ωr + 3*Ωθ)^2*cos(t*(2*Ωr + 3*Ωθ)) + 
1.33*(3*Ωr + 3*Ωθ)^2*cos(t*(3*Ωr + 3*Ωθ)) + 
0.49*(Ωr + 4*Ωθ)^2*cos(t*(Ωr + 4*Ωθ)) - 
0.88*(2*Ωr + 4*Ωθ)^2*cos(t*(2*Ωr + 4*Ωθ)) + 
1.43*(3*Ωr + 4*Ωθ)^2*cos(t*(3*Ωr + 4*Ωθ)) - 
0.98*(2*Ωr + 5*Ωθ)^2*cos(t*(2*Ωr + 5*Ωθ)) - 
1.54*(3*Ωr + 5*Ωθ)^2*cos(t*(3*Ωr + 5*Ωθ)) - 
1.6600000000000001*(3*Ωr + 6*Ωθ)^2*cos(t*(3*Ωr + 6*Ωθ)) - 
0.02*Ωϕ^2*cos(t*Ωϕ) + 0.12*Ωϕ^2*cos(2*t*Ωϕ) - 0.36*Ωϕ^2*cos(3*t*Ωϕ) - 
0.24*(Ωr + Ωϕ)^2*cos(t*(Ωr + Ωϕ)) + 0.59*(2*Ωr + Ωϕ)^2*cos(t*(2*Ωr + Ωϕ)) - 
1.1*(3*Ωr + Ωϕ)^2*cos(t*(3*Ωr + Ωϕ)) - 0.06*(Ωθ + Ωϕ)^2*cos(t*(Ωθ + Ωϕ)) + 
0.29*(Ωr + Ωθ + Ωϕ)^2*cos(t*(Ωr + Ωθ + Ωϕ)) + 
0.65*(2*Ωr + Ωθ + Ωϕ)^2*cos(t*(2*Ωr + Ωθ + Ωϕ)) + 
1.17*(3*Ωr + Ωθ + Ωϕ)^2*cos(t*(3*Ωr + Ωθ + Ωϕ)) + 
0.11*(2*Ωθ + Ωϕ)^2*cos(t*(2*Ωθ + Ωϕ)) + 
0.35000000000000003*(Ωr + 2*Ωθ + Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + Ωϕ)) - 
0.72*(2*Ωr + 2*Ωθ + Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + Ωϕ)) + 
1.25*(3*Ωr + 2*Ωθ + Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + Ωϕ)) + 
0.17*(3*Ωθ + Ωϕ)^2*cos(t*(3*Ωθ + Ωϕ)) - 
0.42*(Ωr + 3*Ωθ + Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + Ωϕ)) - 
0.8*(2*Ωr + 3*Ωθ + Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + Ωϕ)) - 
1.34*(3*Ωr + 3*Ωθ + Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + Ωϕ)) - 
0.5*(Ωr + 4*Ωθ + Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + Ωϕ)) + 
0.89*(2*Ωr + 4*Ωθ + Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + Ωϕ)) - 
1.44*(3*Ωr + 4*Ωθ + Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + Ωϕ)) + 
0.99*(2*Ωr + 5*Ωθ + Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + Ωϕ)) + 
1.55*(3*Ωr + 5*Ωθ + Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + Ωϕ)) + 
1.67*(3*Ωr + 6*Ωθ + Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + Ωϕ)) + 
0.25*(Ωr + 2*Ωϕ)^2*cos(t*(Ωr + 2*Ωϕ)) - 
0.6*(2*Ωr + 2*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωϕ)) + 
1.11*(3*Ωr + 2*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωϕ)) + 
0.07*(Ωθ + 2*Ωϕ)^2*cos(t*(Ωθ + 2*Ωϕ)) - 
0.3*(Ωr + Ωθ + 2*Ωϕ)^2*cos(t*(Ωr + Ωθ + 2*Ωϕ)) - 
0.66*(2*Ωr + Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωr + Ωθ + 2*Ωϕ)) - 
1.18*(3*Ωr + Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 2*Ωϕ)) - 
0.12*(2*Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωθ + 2*Ωϕ)) - 
0.36*(Ωr + 2*Ωθ + 2*Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + 2*Ωϕ)) + 
0.73*(2*Ωr + 2*Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) - 
1.26*(3*Ωr + 2*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) - 
0.18*(3*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωθ + 2*Ωϕ)) + 
0.43*(Ωr + 3*Ωθ + 2*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 2*Ωϕ)) + 
0.81*(2*Ωr + 3*Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) + 
1.35*(3*Ωr + 3*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) + 
0.51*(Ωr + 4*Ωθ + 2*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 2*Ωϕ)) - 
0.9*(2*Ωr + 4*Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) + 
1.45*(3*Ωr + 4*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) - 
1.0*(2*Ωr + 5*Ωθ + 2*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) - 
1.56*(3*Ωr + 5*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) - 
1.68*(3*Ωr + 6*Ωθ + 2*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) - 
0.26*(Ωr + 3*Ωϕ)^2*cos(t*(Ωr + 3*Ωϕ)) + 
0.61*(2*Ωr + 3*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωϕ)) - 
1.12*(3*Ωr + 3*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωϕ)) - 
0.08*(Ωθ + 3*Ωϕ)^2*cos(t*(Ωθ + 3*Ωϕ)) + 
0.31*(Ωr + Ωθ + 3*Ωϕ)^2*cos(t*(Ωr + Ωθ + 3*Ωϕ)) + 
0.67*(2*Ωr + Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωr + Ωθ + 3*Ωϕ)) + 
1.19*(3*Ωr + Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 3*Ωϕ)) + 
0.13*(2*Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωθ + 3*Ωϕ)) + 
0.37*(Ωr + 2*Ωθ + 3*Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + 3*Ωϕ)) - 
0.74*(2*Ωr + 2*Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) + 
1.27*(3*Ωr + 2*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) + 
0.19*(3*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωθ + 3*Ωϕ)) - 
0.44*(Ωr + 3*Ωθ + 3*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 3*Ωϕ)) - 
0.8200000000000001*(2*Ωr + 3*Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) - 
1.36*(3*Ωr + 3*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) - 
0.52*(Ωr + 4*Ωθ + 3*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 3*Ωϕ)) + 
0.91*(2*Ωr + 4*Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) - 
1.46*(3*Ωr + 4*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) + 
1.01*(2*Ωr + 5*Ωθ + 3*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) + 
1.57*(3*Ωr + 5*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) + 
1.69*(3*Ωr + 6*Ωθ + 3*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) + 
0.27*(Ωr + 4*Ωϕ)^2*cos(t*(Ωr + 4*Ωϕ)) - 
0.62*(2*Ωr + 4*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωϕ)) + 
1.1300000000000001*(3*Ωr + 4*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωϕ)) + 
0.09*(Ωθ + 4*Ωϕ)^2*cos(t*(Ωθ + 4*Ωϕ)) - 
0.32*(Ωr + Ωθ + 4*Ωϕ)^2*cos(t*(Ωr + Ωθ + 4*Ωϕ)) - 
0.68*(2*Ωr + Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωr + Ωθ + 4*Ωϕ)) - 
1.2*(3*Ωr + Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 4*Ωϕ)) - 
0.14*(2*Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωθ + 4*Ωϕ)) - 
0.38*(Ωr + 2*Ωθ + 4*Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + 4*Ωϕ)) + 
0.75*(2*Ωr + 2*Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) - 
1.28*(3*Ωr + 2*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) - 
0.2*(3*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωθ + 4*Ωϕ)) + 
0.45*(Ωr + 3*Ωθ + 4*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 4*Ωϕ)) + 
0.8300000000000001*(2*Ωr + 3*Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) + 
1.37*(3*Ωr + 3*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) + 
0.53*(Ωr + 4*Ωθ + 4*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 4*Ωϕ)) - 
0.92*(2*Ωr + 4*Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) + 
1.47*(3*Ωr + 4*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) - 
1.02*(2*Ωr + 5*Ωθ + 4*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) - 
1.58*(3*Ωr + 5*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) - 
1.7*(3*Ωr + 6*Ωθ + 4*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) + 
0.63*(2*Ωr + 5*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωϕ)) - 
1.1400000000000001*(3*Ωr + 5*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωϕ)) + 
0.33*(Ωr + Ωθ + 5*Ωϕ)^2*cos(t*(Ωr + Ωθ + 5*Ωϕ)) + 
0.6900000000000001*(2*Ωr + Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωr + Ωθ + 5*Ωϕ)) + 
1.21*(3*Ωr + Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 5*Ωϕ)) + 
0.15*(2*Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωθ + 5*Ωϕ)) + 
0.39*(Ωr + 2*Ωθ + 5*Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + 5*Ωϕ)) - 
0.76*(2*Ωr + 2*Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) + 
1.29*(3*Ωr + 2*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) + 
0.21*(3*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωθ + 5*Ωϕ)) - 
0.46*(Ωr + 3*Ωθ + 5*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 5*Ωϕ)) - 
0.84*(2*Ωr + 3*Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) - 
1.3800000000000001*(3*Ωr + 3*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) - 
0.54*(Ωr + 4*Ωθ + 5*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 5*Ωϕ)) + 
0.93*(2*Ωr + 4*Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) - 
1.48*(3*Ωr + 4*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) + 
1.03*(2*Ωr + 5*Ωθ + 5*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) + 
1.59*(3*Ωr + 5*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) + 
1.71*(3*Ωr + 6*Ωθ + 5*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) + 
1.1500000000000001*(3*Ωr + 6*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωϕ)) - 
0.7000000000000001*(2*Ωr + Ωθ + 6*Ωϕ)^2*cos(t*(2*Ωr + Ωθ + 6*Ωϕ)) - 
1.22*(3*Ωr + Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 6*Ωϕ)) - 
0.4*(Ωr + 2*Ωθ + 6*Ωϕ)^2*cos(t*(Ωr + 2*Ωθ + 6*Ωϕ)) + 
0.77*(2*Ωr + 2*Ωθ + 6*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) - 
1.3*(3*Ωr + 2*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) - 
0.22*(3*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωθ + 6*Ωϕ)) + 
0.47000000000000003*(Ωr + 3*Ωθ + 6*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 6*Ωϕ)) + 
0.85*(2*Ωr + 3*Ωθ + 6*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) + 
1.3900000000000001*(3*Ωr + 3*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) + 
0.55*(Ωr + 4*Ωθ + 6*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 6*Ωϕ)) - 
0.9400000000000001*(2*Ωr + 4*Ωθ + 6*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) + 
1.49*(3*Ωr + 4*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) - 
1.04*(2*Ωr + 5*Ωθ + 6*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) - 
1.6*(3*Ωr + 5*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) - 
1.72*(3*Ωr + 6*Ωθ + 6*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) + 
1.23*(3*Ωr + Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + Ωθ + 7*Ωϕ)) - 
0.78*(2*Ωr + 2*Ωθ + 7*Ωϕ)^2*cos(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) + 
1.31*(3*Ωr + 2*Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) - 
0.48*(Ωr + 3*Ωθ + 7*Ωϕ)^2*cos(t*(Ωr + 3*Ωθ + 7*Ωϕ)) - 
0.86*(2*Ωr + 3*Ωθ + 7*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) - 
1.4000000000000001*(3*Ωr + 3*Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) - 
0.56*(Ωr + 4*Ωθ + 7*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 7*Ωϕ)) + 
0.9500000000000001*(2*Ωr + 4*Ωθ + 7*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) - 
1.5*(3*Ωr + 4*Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) + 
1.05*(2*Ωr + 5*Ωθ + 7*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) + 
1.61*(3*Ωr + 5*Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) + 
1.73*(3*Ωr + 6*Ωθ + 7*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) - 
1.32*(3*Ωr + 2*Ωθ + 8*Ωϕ)^2*cos(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) + 
0.87*(2*Ωr + 3*Ωθ + 8*Ωϕ)^2*cos(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) + 
1.41*(3*Ωr + 3*Ωθ + 8*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) + 
0.5700000000000001*(Ωr + 4*Ωθ + 8*Ωϕ)^2*cos(t*(Ωr + 4*Ωθ + 8*Ωϕ)) - 
0.96*(2*Ωr + 4*Ωθ + 8*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) + 
1.51*(3*Ωr + 4*Ωθ + 8*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) - 
1.06*(2*Ωr + 5*Ωθ + 8*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) - 
1.62*(3*Ωr + 5*Ωθ + 8*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) - 
1.74*(3*Ωr + 6*Ωθ + 8*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) - 
1.42*(3*Ωr + 3*Ωθ + 9*Ωϕ)^2*cos(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) + 
0.97*(2*Ωr + 4*Ωθ + 9*Ωϕ)^2*cos(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) - 
1.52*(3*Ωr + 4*Ωθ + 9*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) + 
1.07*(2*Ωr + 5*Ωθ + 9*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) + 
1.6300000000000001*(3*Ωr + 5*Ωθ + 9*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) + 
1.75*(3*Ωr + 6*Ωθ + 9*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) + 
1.53*(3*Ωr + 4*Ωθ + 10*Ωϕ)^2*cos(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) - 
1.08*(2*Ωr + 5*Ωθ + 10*Ωϕ)^2*cos(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) - 
1.6400000000000001*(3*Ωr + 5*Ωθ + 10*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) - 
1.76*(3*Ωr + 6*Ωθ + 10*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) + 
1.6500000000000001*(3*Ωr + 5*Ωθ + 11*Ωϕ)^2*cos(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) + 
1.77*(3*Ωr + 6*Ωθ + 11*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) - 
1.78*(3*Ωr + 6*Ωθ + 12*Ωϕ)^2*cos(t*(3*Ωr + 6*Ωθ + 12*Ωϕ)) + 
2.0100000000000002*Ωr^2*sin(t*Ωr) - 9.44*Ωr^2*sin(2*t*Ωr) + 
25.830000000000002*Ωr^2*sin(3*t*Ωr) + 1.83*Ωθ^2*sin(t*Ωθ) - 
7.5200000000000005*Ωθ^2*sin(2*t*Ωθ) - 17.46*Ωθ^2*sin(3*t*Ωθ) - 
2.06*(Ωr + Ωθ)^2*sin(t*(Ωr + Ωθ)) - 2.42*(2*Ωr + Ωθ)^2*sin(t*(2*Ωr + Ωθ)) - 
2.94*(3*Ωr + Ωθ)^2*sin(t*(3*Ωr + Ωθ)) - 
2.12*(Ωr + 2*Ωθ)^2*sin(t*(Ωr + 2*Ωθ)) + 
2.49*(2*Ωr + 2*Ωθ)^2*sin(t*(2*Ωr + 2*Ωθ)) - 
3.02*(3*Ωr + 2*Ωθ)^2*sin(t*(3*Ωr + 2*Ωθ)) + 
2.19*(Ωr + 3*Ωθ)^2*sin(t*(Ωr + 3*Ωθ)) + 
2.57*(2*Ωr + 3*Ωθ)^2*sin(t*(2*Ωr + 3*Ωθ)) + 
3.11*(3*Ωr + 3*Ωθ)^2*sin(t*(3*Ωr + 3*Ωθ)) + 
2.27*(Ωr + 4*Ωθ)^2*sin(t*(Ωr + 4*Ωθ)) - 
2.66*(2*Ωr + 4*Ωθ)^2*sin(t*(2*Ωr + 4*Ωθ)) + 
3.21*(3*Ωr + 4*Ωθ)^2*sin(t*(3*Ωr + 4*Ωθ)) - 
2.7600000000000002*(2*Ωr + 5*Ωθ)^2*sin(t*(2*Ωr + 5*Ωθ)) - 
3.3200000000000003*(3*Ωr + 5*Ωθ)^2*sin(t*(3*Ωr + 5*Ωθ)) - 
3.44*(3*Ωr + 6*Ωθ)^2*sin(t*(3*Ωr + 6*Ωθ)) - 1.8*Ωϕ^2*sin(t*Ωϕ) + 
7.24*Ωϕ^2*sin(2*t*Ωϕ) - 16.38*Ωϕ^2*sin(3*t*Ωϕ) - 
2.02*(Ωr + Ωϕ)^2*sin(t*(Ωr + Ωϕ)) + 2.37*(2*Ωr + Ωϕ)^2*sin(t*(2*Ωr + Ωϕ)) - 
2.88*(3*Ωr + Ωϕ)^2*sin(t*(3*Ωr + Ωϕ)) - 1.84*(Ωθ + Ωϕ)^2*sin(t*(Ωθ + Ωϕ)) + 
2.07*(Ωr + Ωθ + Ωϕ)^2*sin(t*(Ωr + Ωθ + Ωϕ)) + 
2.43*(2*Ωr + Ωθ + Ωϕ)^2*sin(t*(2*Ωr + Ωθ + Ωϕ)) + 
2.95*(3*Ωr + Ωθ + Ωϕ)^2*sin(t*(3*Ωr + Ωθ + Ωϕ)) + 
1.8900000000000001*(2*Ωθ + Ωϕ)^2*sin(t*(2*Ωθ + Ωϕ)) + 
2.13*(Ωr + 2*Ωθ + Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + Ωϕ)) - 
2.5*(2*Ωr + 2*Ωθ + Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + Ωϕ)) + 
3.0300000000000002*(3*Ωr + 2*Ωθ + Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + Ωϕ)) + 
1.95*(3*Ωθ + Ωϕ)^2*sin(t*(3*Ωθ + Ωϕ)) - 
2.2*(Ωr + 3*Ωθ + Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + Ωϕ)) - 
2.58*(2*Ωr + 3*Ωθ + Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + Ωϕ)) - 
3.12*(3*Ωr + 3*Ωθ + Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + Ωϕ)) - 
2.2800000000000002*(Ωr + 4*Ωθ + Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + Ωϕ)) + 
2.67*(2*Ωr + 4*Ωθ + Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + Ωϕ)) - 
3.22*(3*Ωr + 4*Ωθ + Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + Ωϕ)) + 
2.77*(2*Ωr + 5*Ωθ + Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + Ωϕ)) + 
3.33*(3*Ωr + 5*Ωθ + Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + Ωϕ)) + 
3.45*(3*Ωr + 6*Ωθ + Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + Ωϕ)) + 
2.0300000000000002*(Ωr + 2*Ωϕ)^2*sin(t*(Ωr + 2*Ωϕ)) - 
2.38*(2*Ωr + 2*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωϕ)) + 
2.89*(3*Ωr + 2*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωϕ)) + 
1.85*(Ωθ + 2*Ωϕ)^2*sin(t*(Ωθ + 2*Ωϕ)) - 
2.08*(Ωr + Ωθ + 2*Ωϕ)^2*sin(t*(Ωr + Ωθ + 2*Ωϕ)) - 
2.44*(2*Ωr + Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωr + Ωθ + 2*Ωϕ)) - 
2.96*(3*Ωr + Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 2*Ωϕ)) - 
1.9000000000000001*(2*Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωθ + 2*Ωϕ)) - 
2.14*(Ωr + 2*Ωθ + 2*Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + 2*Ωϕ)) + 
2.5100000000000002*(2*Ωr + 2*Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) - 
3.04*(3*Ωr + 2*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) - 
1.96*(3*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωθ + 2*Ωϕ)) + 
2.21*(Ωr + 3*Ωθ + 2*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 2*Ωϕ)) + 
2.59*(2*Ωr + 3*Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) + 
3.13*(3*Ωr + 3*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) + 
2.29*(Ωr + 4*Ωθ + 2*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 2*Ωϕ)) - 
2.68*(2*Ωr + 4*Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) + 
3.23*(3*Ωr + 4*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) - 
2.7800000000000002*(2*Ωr + 5*Ωθ + 2*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) - 
3.34*(3*Ωr + 5*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) - 
3.46*(3*Ωr + 6*Ωθ + 2*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) - 
2.04*(Ωr + 3*Ωϕ)^2*sin(t*(Ωr + 3*Ωϕ)) + 
2.39*(2*Ωr + 3*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωϕ)) - 
2.9*(3*Ωr + 3*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωϕ)) - 
1.86*(Ωθ + 3*Ωϕ)^2*sin(t*(Ωθ + 3*Ωϕ)) + 
2.09*(Ωr + Ωθ + 3*Ωϕ)^2*sin(t*(Ωr + Ωθ + 3*Ωϕ)) + 
2.45*(2*Ωr + Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωr + Ωθ + 3*Ωϕ)) + 
2.97*(3*Ωr + Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 3*Ωϕ)) + 
1.9100000000000001*(2*Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωθ + 3*Ωϕ)) + 
2.15*(Ωr + 2*Ωθ + 3*Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + 3*Ωϕ)) - 
2.52*(2*Ωr + 2*Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) + 
3.0500000000000003*(3*Ωr + 2*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) + 
1.97*(3*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωθ + 3*Ωϕ)) - 
2.22*(Ωr + 3*Ωθ + 3*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 3*Ωϕ)) - 
2.6*(2*Ωr + 3*Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) - 
3.14*(3*Ωr + 3*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) - 
2.3000000000000003*(Ωr + 4*Ωθ + 3*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 3*Ωϕ)) + 
2.69*(2*Ωr + 4*Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) - 
3.24*(3*Ωr + 4*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) + 
2.79*(2*Ωr + 5*Ωθ + 3*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) + 
3.35*(3*Ωr + 5*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) + 
3.47*(3*Ωr + 6*Ωθ + 3*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) + 
2.05*(Ωr + 4*Ωϕ)^2*sin(t*(Ωr + 4*Ωϕ)) - 
2.4*(2*Ωr + 4*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωϕ)) + 
2.91*(3*Ωr + 4*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωϕ)) + 
1.87*(Ωθ + 4*Ωϕ)^2*sin(t*(Ωθ + 4*Ωϕ)) - 
2.1*(Ωr + Ωθ + 4*Ωϕ)^2*sin(t*(Ωr + Ωθ + 4*Ωϕ)) - 
2.46*(2*Ωr + Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωr + Ωθ + 4*Ωϕ)) - 
2.98*(3*Ωr + Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 4*Ωϕ)) - 
1.92*(2*Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωθ + 4*Ωϕ)) - 
2.16*(Ωr + 2*Ωθ + 4*Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + 4*Ωϕ)) + 
2.5300000000000002*(2*Ωr + 2*Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) - 
3.06*(3*Ωr + 2*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) - 
1.98*(3*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωθ + 4*Ωϕ)) + 
2.23*(Ωr + 3*Ωθ + 4*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 4*Ωϕ)) + 
2.61*(2*Ωr + 3*Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) + 
3.15*(3*Ωr + 3*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) + 
2.31*(Ωr + 4*Ωθ + 4*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 4*Ωϕ)) - 
2.7*(2*Ωr + 4*Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) + 
3.25*(3*Ωr + 4*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) - 
2.8000000000000003*(2*Ωr + 5*Ωθ + 4*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) - 
3.36*(3*Ωr + 5*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) - 
3.48*(3*Ωr + 6*Ωθ + 4*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) + 
2.41*(2*Ωr + 5*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωϕ)) - 
2.92*(3*Ωr + 5*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωϕ)) + 
2.11*(Ωr + Ωθ + 5*Ωϕ)^2*sin(t*(Ωr + Ωθ + 5*Ωϕ)) + 
2.47*(2*Ωr + Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωr + Ωθ + 5*Ωϕ)) + 
2.99*(3*Ωr + Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 5*Ωϕ)) + 
1.93*(2*Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωθ + 5*Ωϕ)) + 
2.17*(Ωr + 2*Ωθ + 5*Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + 5*Ωϕ)) - 
2.54*(2*Ωr + 2*Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) + 
3.0700000000000003*(3*Ωr + 2*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) + 
1.99*(3*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωθ + 5*Ωϕ)) - 
2.24*(Ωr + 3*Ωθ + 5*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 5*Ωϕ)) - 
2.62*(2*Ωr + 3*Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) - 
3.16*(3*Ωr + 3*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) - 
2.32*(Ωr + 4*Ωθ + 5*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 5*Ωϕ)) + 
2.71*(2*Ωr + 4*Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) - 
3.2600000000000002*(3*Ωr + 4*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) + 
2.81*(2*Ωr + 5*Ωθ + 5*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) + 
3.37*(3*Ωr + 5*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) + 
3.49*(3*Ωr + 6*Ωθ + 5*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) + 
2.93*(3*Ωr + 6*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωϕ)) - 
2.48*(2*Ωr + Ωθ + 6*Ωϕ)^2*sin(t*(2*Ωr + Ωθ + 6*Ωϕ)) - 
3.0*(3*Ωr + Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 6*Ωϕ)) - 
2.18*(Ωr + 2*Ωθ + 6*Ωϕ)^2*sin(t*(Ωr + 2*Ωθ + 6*Ωϕ)) + 
2.5500000000000003*(2*Ωr + 2*Ωθ + 6*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) - 
3.08*(3*Ωr + 2*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) - 
2.0*(3*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωθ + 6*Ωϕ)) + 
2.25*(Ωr + 3*Ωθ + 6*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 6*Ωϕ)) + 
2.63*(2*Ωr + 3*Ωθ + 6*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) + 
3.17*(3*Ωr + 3*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) + 
2.33*(Ωr + 4*Ωθ + 6*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 6*Ωϕ)) - 
2.72*(2*Ωr + 4*Ωθ + 6*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) + 
3.27*(3*Ωr + 4*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) - 
2.82*(2*Ωr + 5*Ωθ + 6*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) - 
3.38*(3*Ωr + 5*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) - 
3.5*(3*Ωr + 6*Ωθ + 6*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) + 
3.0100000000000002*(3*Ωr + Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + Ωθ + 7*Ωϕ)) - 
2.56*(2*Ωr + 2*Ωθ + 7*Ωϕ)^2*sin(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) + 
3.09*(3*Ωr + 2*Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) - 
2.2600000000000002*(Ωr + 3*Ωθ + 7*Ωϕ)^2*sin(t*(Ωr + 3*Ωθ + 7*Ωϕ)) - 
2.64*(2*Ωr + 3*Ωθ + 7*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) - 
3.18*(3*Ωr + 3*Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) - 
2.34*(Ωr + 4*Ωθ + 7*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 7*Ωϕ)) + 
2.73*(2*Ωr + 4*Ωθ + 7*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) - 
3.2800000000000002*(3*Ωr + 4*Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) + 
2.83*(2*Ωr + 5*Ωθ + 7*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) + 
3.39*(3*Ωr + 5*Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) + 
3.5100000000000002*(3*Ωr + 6*Ωθ + 7*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) - 
3.1*(3*Ωr + 2*Ωθ + 8*Ωϕ)^2*sin(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) + 
2.65*(2*Ωr + 3*Ωθ + 8*Ωϕ)^2*sin(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) + 
3.19*(3*Ωr + 3*Ωθ + 8*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) + 
2.35*(Ωr + 4*Ωθ + 8*Ωϕ)^2*sin(t*(Ωr + 4*Ωθ + 8*Ωϕ)) - 
2.74*(2*Ωr + 4*Ωθ + 8*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) + 
3.29*(3*Ωr + 4*Ωθ + 8*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) - 
2.84*(2*Ωr + 5*Ωθ + 8*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) - 
3.4*(3*Ωr + 5*Ωθ + 8*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) - 
3.52*(3*Ωr + 6*Ωθ + 8*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) - 
3.2*(3*Ωr + 3*Ωθ + 9*Ωϕ)^2*sin(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) + 
2.75*(2*Ωr + 4*Ωθ + 9*Ωϕ)^2*sin(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) - 
3.3000000000000003*(3*Ωr + 4*Ωθ + 9*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) + 
2.85*(2*Ωr + 5*Ωθ + 9*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) + 
3.41*(3*Ωr + 5*Ωθ + 9*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) + 
3.5300000000000002*(3*Ωr + 6*Ωθ + 9*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) + 
3.31*(3*Ωr + 4*Ωθ + 10*Ωϕ)^2*sin(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) - 
2.86*(2*Ωr + 5*Ωθ + 10*Ωϕ)^2*sin(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) - 
3.42*(3*Ωr + 5*Ωθ + 10*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) - 
3.54*(3*Ωr + 6*Ωθ + 10*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) + 
3.43*(3*Ωr + 5*Ωθ + 11*Ωϕ)^2*sin(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) + 
3.5500000000000003*(3*Ωr + 6*Ωθ + 11*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) - 
3.56*(3*Ωr + 6*Ωθ + 12*Ωϕ)^2*sin(t*(3*Ωr + 6*Ωθ + 12*Ωϕ))

f4(t::Float64, Ωr::Float64, Ωθ::Float64, Ωϕ::Float64)=        -0.23*Ωr^4*cos(t*Ωr) + 9.28*Ωr^4*cos(2*t*Ωr) - 88.29*Ωr^4*cos(3*t*Ωr) - 
0.05*Ωθ^4*cos(t*Ωθ) + 1.6*Ωθ^4*cos(2*t*Ωθ) + 12.96*Ωθ^4*cos(3*t*Ωθ) + 
0.28*(Ωr + Ωθ)^4*cos(t*(Ωr + Ωθ)) + 0.64*(2*Ωr + Ωθ)^4*cos(t*(2*Ωr + Ωθ)) + 
1.16*(3*Ωr + Ωθ)^4*cos(t*(3*Ωr + Ωθ)) + 
0.34*(Ωr + 2*Ωθ)^4*cos(t*(Ωr + 2*Ωθ)) - 
0.71*(2*Ωr + 2*Ωθ)^4*cos(t*(2*Ωr + 2*Ωθ)) + 
1.24*(3*Ωr + 2*Ωθ)^4*cos(t*(3*Ωr + 2*Ωθ)) - 
0.41000000000000003*(Ωr + 3*Ωθ)^4*cos(t*(Ωr + 3*Ωθ)) - 
0.79*(2*Ωr + 3*Ωθ)^4*cos(t*(2*Ωr + 3*Ωθ)) - 
1.33*(3*Ωr + 3*Ωθ)^4*cos(t*(3*Ωr + 3*Ωθ)) - 
0.49*(Ωr + 4*Ωθ)^4*cos(t*(Ωr + 4*Ωθ)) + 
0.88*(2*Ωr + 4*Ωθ)^4*cos(t*(2*Ωr + 4*Ωθ)) - 
1.43*(3*Ωr + 4*Ωθ)^4*cos(t*(3*Ωr + 4*Ωθ)) + 
0.98*(2*Ωr + 5*Ωθ)^4*cos(t*(2*Ωr + 5*Ωθ)) + 
1.54*(3*Ωr + 5*Ωθ)^4*cos(t*(3*Ωr + 5*Ωθ)) + 
1.6600000000000001*(3*Ωr + 6*Ωθ)^4*cos(t*(3*Ωr + 6*Ωθ)) + 
0.02*Ωϕ^4*cos(t*Ωϕ) - 0.48*Ωϕ^4*cos(2*t*Ωϕ) + 3.24*Ωϕ^4*cos(3*t*Ωϕ) + 
0.24*(Ωr + Ωϕ)^4*cos(t*(Ωr + Ωϕ)) - 0.59*(2*Ωr + Ωϕ)^4*cos(t*(2*Ωr + Ωϕ)) + 
1.1*(3*Ωr + Ωϕ)^4*cos(t*(3*Ωr + Ωϕ)) + 0.06*(Ωθ + Ωϕ)^4*cos(t*(Ωθ + Ωϕ)) - 
0.29*(Ωr + Ωθ + Ωϕ)^4*cos(t*(Ωr + Ωθ + Ωϕ)) - 
0.65*(2*Ωr + Ωθ + Ωϕ)^4*cos(t*(2*Ωr + Ωθ + Ωϕ)) - 
1.17*(3*Ωr + Ωθ + Ωϕ)^4*cos(t*(3*Ωr + Ωθ + Ωϕ)) - 
0.11*(2*Ωθ + Ωϕ)^4*cos(t*(2*Ωθ + Ωϕ)) - 
0.35000000000000003*(Ωr + 2*Ωθ + Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + Ωϕ)) + 
0.72*(2*Ωr + 2*Ωθ + Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + Ωϕ)) - 
1.25*(3*Ωr + 2*Ωθ + Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + Ωϕ)) - 
0.17*(3*Ωθ + Ωϕ)^4*cos(t*(3*Ωθ + Ωϕ)) + 
0.42*(Ωr + 3*Ωθ + Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + Ωϕ)) + 
0.8*(2*Ωr + 3*Ωθ + Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + Ωϕ)) + 
1.34*(3*Ωr + 3*Ωθ + Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + Ωϕ)) + 
0.5*(Ωr + 4*Ωθ + Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + Ωϕ)) - 
0.89*(2*Ωr + 4*Ωθ + Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + Ωϕ)) + 
1.44*(3*Ωr + 4*Ωθ + Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + Ωϕ)) - 
0.99*(2*Ωr + 5*Ωθ + Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + Ωϕ)) - 
1.55*(3*Ωr + 5*Ωθ + Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + Ωϕ)) - 
1.67*(3*Ωr + 6*Ωθ + Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + Ωϕ)) - 
0.25*(Ωr + 2*Ωϕ)^4*cos(t*(Ωr + 2*Ωϕ)) + 
0.6*(2*Ωr + 2*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωϕ)) - 
1.11*(3*Ωr + 2*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωϕ)) - 
0.07*(Ωθ + 2*Ωϕ)^4*cos(t*(Ωθ + 2*Ωϕ)) + 
0.3*(Ωr + Ωθ + 2*Ωϕ)^4*cos(t*(Ωr + Ωθ + 2*Ωϕ)) + 
0.66*(2*Ωr + Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωr + Ωθ + 2*Ωϕ)) + 
1.18*(3*Ωr + Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 2*Ωϕ)) + 
0.12*(2*Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωθ + 2*Ωϕ)) + 
0.36*(Ωr + 2*Ωθ + 2*Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + 2*Ωϕ)) - 
0.73*(2*Ωr + 2*Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) + 
1.26*(3*Ωr + 2*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) + 
0.18*(3*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωθ + 2*Ωϕ)) - 
0.43*(Ωr + 3*Ωθ + 2*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 2*Ωϕ)) - 
0.81*(2*Ωr + 3*Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) - 
1.35*(3*Ωr + 3*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) - 
0.51*(Ωr + 4*Ωθ + 2*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 2*Ωϕ)) + 
0.9*(2*Ωr + 4*Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) - 
1.45*(3*Ωr + 4*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) + 
1.0*(2*Ωr + 5*Ωθ + 2*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) + 
1.56*(3*Ωr + 5*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) + 
1.68*(3*Ωr + 6*Ωθ + 2*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) + 
0.26*(Ωr + 3*Ωϕ)^4*cos(t*(Ωr + 3*Ωϕ)) - 
0.61*(2*Ωr + 3*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωϕ)) + 
1.12*(3*Ωr + 3*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωϕ)) + 
0.08*(Ωθ + 3*Ωϕ)^4*cos(t*(Ωθ + 3*Ωϕ)) - 
0.31*(Ωr + Ωθ + 3*Ωϕ)^4*cos(t*(Ωr + Ωθ + 3*Ωϕ)) - 
0.67*(2*Ωr + Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωr + Ωθ + 3*Ωϕ)) - 
1.19*(3*Ωr + Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 3*Ωϕ)) - 
0.13*(2*Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωθ + 3*Ωϕ)) - 
0.37*(Ωr + 2*Ωθ + 3*Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + 3*Ωϕ)) + 
0.74*(2*Ωr + 2*Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) - 
1.27*(3*Ωr + 2*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) - 
0.19*(3*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωθ + 3*Ωϕ)) + 
0.44*(Ωr + 3*Ωθ + 3*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 3*Ωϕ)) + 
0.8200000000000001*(2*Ωr + 3*Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) + 
1.36*(3*Ωr + 3*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) + 
0.52*(Ωr + 4*Ωθ + 3*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 3*Ωϕ)) - 
0.91*(2*Ωr + 4*Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) + 
1.46*(3*Ωr + 4*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) - 
1.01*(2*Ωr + 5*Ωθ + 3*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) - 
1.57*(3*Ωr + 5*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) - 
1.69*(3*Ωr + 6*Ωθ + 3*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) - 
0.27*(Ωr + 4*Ωϕ)^4*cos(t*(Ωr + 4*Ωϕ)) + 
0.62*(2*Ωr + 4*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωϕ)) - 
1.1300000000000001*(3*Ωr + 4*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωϕ)) - 
0.09*(Ωθ + 4*Ωϕ)^4*cos(t*(Ωθ + 4*Ωϕ)) + 
0.32*(Ωr + Ωθ + 4*Ωϕ)^4*cos(t*(Ωr + Ωθ + 4*Ωϕ)) + 
0.68*(2*Ωr + Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωr + Ωθ + 4*Ωϕ)) + 
1.2*(3*Ωr + Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 4*Ωϕ)) + 
0.14*(2*Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωθ + 4*Ωϕ)) + 
0.38*(Ωr + 2*Ωθ + 4*Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + 4*Ωϕ)) - 
0.75*(2*Ωr + 2*Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) + 
1.28*(3*Ωr + 2*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) + 
0.2*(3*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωθ + 4*Ωϕ)) - 
0.45*(Ωr + 3*Ωθ + 4*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 4*Ωϕ)) - 
0.8300000000000001*(2*Ωr + 3*Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) - 
1.37*(3*Ωr + 3*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) - 
0.53*(Ωr + 4*Ωθ + 4*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 4*Ωϕ)) + 
0.92*(2*Ωr + 4*Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) - 
1.47*(3*Ωr + 4*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) + 
1.02*(2*Ωr + 5*Ωθ + 4*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) + 
1.58*(3*Ωr + 5*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) + 
1.7*(3*Ωr + 6*Ωθ + 4*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) - 
0.63*(2*Ωr + 5*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωϕ)) + 
1.1400000000000001*(3*Ωr + 5*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωϕ)) - 
0.33*(Ωr + Ωθ + 5*Ωϕ)^4*cos(t*(Ωr + Ωθ + 5*Ωϕ)) - 
0.6900000000000001*(2*Ωr + Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωr + Ωθ + 5*Ωϕ)) - 
1.21*(3*Ωr + Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 5*Ωϕ)) - 
0.15*(2*Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωθ + 5*Ωϕ)) - 
0.39*(Ωr + 2*Ωθ + 5*Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + 5*Ωϕ)) + 
0.76*(2*Ωr + 2*Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) - 
1.29*(3*Ωr + 2*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) - 
0.21*(3*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωθ + 5*Ωϕ)) + 
0.46*(Ωr + 3*Ωθ + 5*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 5*Ωϕ)) + 
0.84*(2*Ωr + 3*Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) + 
1.3800000000000001*(3*Ωr + 3*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) + 
0.54*(Ωr + 4*Ωθ + 5*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 5*Ωϕ)) - 
0.93*(2*Ωr + 4*Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) + 
1.48*(3*Ωr + 4*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) - 
1.03*(2*Ωr + 5*Ωθ + 5*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) - 
1.59*(3*Ωr + 5*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) - 
1.71*(3*Ωr + 6*Ωθ + 5*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) - 
1.1500000000000001*(3*Ωr + 6*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωϕ)) + 
0.7000000000000001*(2*Ωr + Ωθ + 6*Ωϕ)^4*cos(t*(2*Ωr + Ωθ + 6*Ωϕ)) + 
1.22*(3*Ωr + Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 6*Ωϕ)) + 
0.4*(Ωr + 2*Ωθ + 6*Ωϕ)^4*cos(t*(Ωr + 2*Ωθ + 6*Ωϕ)) - 
0.77*(2*Ωr + 2*Ωθ + 6*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) + 
1.3*(3*Ωr + 2*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) + 
0.22*(3*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωθ + 6*Ωϕ)) - 
0.47000000000000003*(Ωr + 3*Ωθ + 6*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 6*Ωϕ)) - 
0.85*(2*Ωr + 3*Ωθ + 6*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) - 
1.3900000000000001*(3*Ωr + 3*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) - 
0.55*(Ωr + 4*Ωθ + 6*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 6*Ωϕ)) + 
0.9400000000000001*(2*Ωr + 4*Ωθ + 6*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) - 
1.49*(3*Ωr + 4*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) + 
1.04*(2*Ωr + 5*Ωθ + 6*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) + 
1.6*(3*Ωr + 5*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) + 
1.72*(3*Ωr + 6*Ωθ + 6*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) - 
1.23*(3*Ωr + Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + Ωθ + 7*Ωϕ)) + 
0.78*(2*Ωr + 2*Ωθ + 7*Ωϕ)^4*cos(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) - 
1.31*(3*Ωr + 2*Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) + 
0.48*(Ωr + 3*Ωθ + 7*Ωϕ)^4*cos(t*(Ωr + 3*Ωθ + 7*Ωϕ)) + 
0.86*(2*Ωr + 3*Ωθ + 7*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) + 
1.4000000000000001*(3*Ωr + 3*Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) + 
0.56*(Ωr + 4*Ωθ + 7*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 7*Ωϕ)) - 
0.9500000000000001*(2*Ωr + 4*Ωθ + 7*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) + 
1.5*(3*Ωr + 4*Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) - 
1.05*(2*Ωr + 5*Ωθ + 7*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) - 
1.61*(3*Ωr + 5*Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) - 
1.73*(3*Ωr + 6*Ωθ + 7*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) + 
1.32*(3*Ωr + 2*Ωθ + 8*Ωϕ)^4*cos(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) - 
0.87*(2*Ωr + 3*Ωθ + 8*Ωϕ)^4*cos(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) - 
1.41*(3*Ωr + 3*Ωθ + 8*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) - 
0.5700000000000001*(Ωr + 4*Ωθ + 8*Ωϕ)^4*cos(t*(Ωr + 4*Ωθ + 8*Ωϕ)) + 
0.96*(2*Ωr + 4*Ωθ + 8*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) - 
1.51*(3*Ωr + 4*Ωθ + 8*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) + 
1.06*(2*Ωr + 5*Ωθ + 8*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) + 
1.62*(3*Ωr + 5*Ωθ + 8*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) + 
1.74*(3*Ωr + 6*Ωθ + 8*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) + 
1.42*(3*Ωr + 3*Ωθ + 9*Ωϕ)^4*cos(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) - 
0.97*(2*Ωr + 4*Ωθ + 9*Ωϕ)^4*cos(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) + 
1.52*(3*Ωr + 4*Ωθ + 9*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) - 
1.07*(2*Ωr + 5*Ωθ + 9*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) - 
1.6300000000000001*(3*Ωr + 5*Ωθ + 9*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) - 
1.75*(3*Ωr + 6*Ωθ + 9*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) - 
1.53*(3*Ωr + 4*Ωθ + 10*Ωϕ)^4*cos(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) + 
1.08*(2*Ωr + 5*Ωθ + 10*Ωϕ)^4*cos(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) + 
1.6400000000000001*(3*Ωr + 5*Ωθ + 10*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) + 
1.76*(3*Ωr + 6*Ωθ + 10*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) - 
1.6500000000000001*(3*Ωr + 5*Ωθ + 11*Ωϕ)^4*cos(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) - 
1.77*(3*Ωr + 6*Ωθ + 11*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) + 
1.78*(3*Ωr + 6*Ωθ + 12*Ωϕ)^4*cos(t*(3*Ωr + 6*Ωθ + 12*Ωϕ)) - 
2.0100000000000002*Ωr^4*sin(t*Ωr) + 37.76*Ωr^4*sin(2*t*Ωr) - 
232.47*Ωr^4*sin(3*t*Ωr) - 1.83*Ωθ^4*sin(t*Ωθ) + 
30.080000000000002*Ωθ^4*sin(2*t*Ωθ) + 157.14*Ωθ^4*sin(3*t*Ωθ) + 
2.06*(Ωr + Ωθ)^4*sin(t*(Ωr + Ωθ)) + 2.42*(2*Ωr + Ωθ)^4*sin(t*(2*Ωr + Ωθ)) + 
2.94*(3*Ωr + Ωθ)^4*sin(t*(3*Ωr + Ωθ)) + 
2.12*(Ωr + 2*Ωθ)^4*sin(t*(Ωr + 2*Ωθ)) - 
2.49*(2*Ωr + 2*Ωθ)^4*sin(t*(2*Ωr + 2*Ωθ)) + 
3.02*(3*Ωr + 2*Ωθ)^4*sin(t*(3*Ωr + 2*Ωθ)) - 
2.19*(Ωr + 3*Ωθ)^4*sin(t*(Ωr + 3*Ωθ)) - 
2.57*(2*Ωr + 3*Ωθ)^4*sin(t*(2*Ωr + 3*Ωθ)) - 
3.11*(3*Ωr + 3*Ωθ)^4*sin(t*(3*Ωr + 3*Ωθ)) - 
2.27*(Ωr + 4*Ωθ)^4*sin(t*(Ωr + 4*Ωθ)) + 
2.66*(2*Ωr + 4*Ωθ)^4*sin(t*(2*Ωr + 4*Ωθ)) - 
3.21*(3*Ωr + 4*Ωθ)^4*sin(t*(3*Ωr + 4*Ωθ)) + 
2.7600000000000002*(2*Ωr + 5*Ωθ)^4*sin(t*(2*Ωr + 5*Ωθ)) + 
3.3200000000000003*(3*Ωr + 5*Ωθ)^4*sin(t*(3*Ωr + 5*Ωθ)) + 
3.44*(3*Ωr + 6*Ωθ)^4*sin(t*(3*Ωr + 6*Ωθ)) + 1.8*Ωϕ^4*sin(t*Ωϕ) - 
28.96*Ωϕ^4*sin(2*t*Ωϕ) + 147.42000000000002*Ωϕ^4*sin(3*t*Ωϕ) + 
2.02*(Ωr + Ωϕ)^4*sin(t*(Ωr + Ωϕ)) - 2.37*(2*Ωr + Ωϕ)^4*sin(t*(2*Ωr + Ωϕ)) + 
2.88*(3*Ωr + Ωϕ)^4*sin(t*(3*Ωr + Ωϕ)) + 1.84*(Ωθ + Ωϕ)^4*sin(t*(Ωθ + Ωϕ)) - 
2.07*(Ωr + Ωθ + Ωϕ)^4*sin(t*(Ωr + Ωθ + Ωϕ)) - 
2.43*(2*Ωr + Ωθ + Ωϕ)^4*sin(t*(2*Ωr + Ωθ + Ωϕ)) - 
2.95*(3*Ωr + Ωθ + Ωϕ)^4*sin(t*(3*Ωr + Ωθ + Ωϕ)) - 
1.8900000000000001*(2*Ωθ + Ωϕ)^4*sin(t*(2*Ωθ + Ωϕ)) - 
2.13*(Ωr + 2*Ωθ + Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + Ωϕ)) + 
2.5*(2*Ωr + 2*Ωθ + Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + Ωϕ)) - 
3.0300000000000002*(3*Ωr + 2*Ωθ + Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + Ωϕ)) - 
1.95*(3*Ωθ + Ωϕ)^4*sin(t*(3*Ωθ + Ωϕ)) + 
2.2*(Ωr + 3*Ωθ + Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + Ωϕ)) + 
2.58*(2*Ωr + 3*Ωθ + Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + Ωϕ)) + 
3.12*(3*Ωr + 3*Ωθ + Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + Ωϕ)) + 
2.2800000000000002*(Ωr + 4*Ωθ + Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + Ωϕ)) - 
2.67*(2*Ωr + 4*Ωθ + Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + Ωϕ)) + 
3.22*(3*Ωr + 4*Ωθ + Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + Ωϕ)) - 
2.77*(2*Ωr + 5*Ωθ + Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + Ωϕ)) - 
3.33*(3*Ωr + 5*Ωθ + Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + Ωϕ)) - 
3.45*(3*Ωr + 6*Ωθ + Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + Ωϕ)) - 
2.0300000000000002*(Ωr + 2*Ωϕ)^4*sin(t*(Ωr + 2*Ωϕ)) + 
2.38*(2*Ωr + 2*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωϕ)) - 
2.89*(3*Ωr + 2*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωϕ)) - 
1.85*(Ωθ + 2*Ωϕ)^4*sin(t*(Ωθ + 2*Ωϕ)) + 
2.08*(Ωr + Ωθ + 2*Ωϕ)^4*sin(t*(Ωr + Ωθ + 2*Ωϕ)) + 
2.44*(2*Ωr + Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωr + Ωθ + 2*Ωϕ)) + 
2.96*(3*Ωr + Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 2*Ωϕ)) + 
1.9000000000000001*(2*Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωθ + 2*Ωϕ)) + 
2.14*(Ωr + 2*Ωθ + 2*Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + 2*Ωϕ)) - 
2.5100000000000002*(2*Ωr + 2*Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) + 
3.04*(3*Ωr + 2*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) + 
1.96*(3*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωθ + 2*Ωϕ)) - 
2.21*(Ωr + 3*Ωθ + 2*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 2*Ωϕ)) - 
2.59*(2*Ωr + 3*Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) - 
3.13*(3*Ωr + 3*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) - 
2.29*(Ωr + 4*Ωθ + 2*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 2*Ωϕ)) + 
2.68*(2*Ωr + 4*Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) - 
3.23*(3*Ωr + 4*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) + 
2.7800000000000002*(2*Ωr + 5*Ωθ + 2*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) + 
3.34*(3*Ωr + 5*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) + 
3.46*(3*Ωr + 6*Ωθ + 2*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) + 
2.04*(Ωr + 3*Ωϕ)^4*sin(t*(Ωr + 3*Ωϕ)) - 
2.39*(2*Ωr + 3*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωϕ)) + 
2.9*(3*Ωr + 3*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωϕ)) + 
1.86*(Ωθ + 3*Ωϕ)^4*sin(t*(Ωθ + 3*Ωϕ)) - 
2.09*(Ωr + Ωθ + 3*Ωϕ)^4*sin(t*(Ωr + Ωθ + 3*Ωϕ)) - 
2.45*(2*Ωr + Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωr + Ωθ + 3*Ωϕ)) - 
2.97*(3*Ωr + Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 3*Ωϕ)) - 
1.9100000000000001*(2*Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωθ + 3*Ωϕ)) - 
2.15*(Ωr + 2*Ωθ + 3*Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + 3*Ωϕ)) + 
2.52*(2*Ωr + 2*Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) - 
3.0500000000000003*(3*Ωr + 2*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) - 
1.97*(3*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωθ + 3*Ωϕ)) + 
2.22*(Ωr + 3*Ωθ + 3*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 3*Ωϕ)) + 
2.6*(2*Ωr + 3*Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) + 
3.14*(3*Ωr + 3*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) + 
2.3000000000000003*(Ωr + 4*Ωθ + 3*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 3*Ωϕ)) - 
2.69*(2*Ωr + 4*Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) + 
3.24*(3*Ωr + 4*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) - 
2.79*(2*Ωr + 5*Ωθ + 3*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) - 
3.35*(3*Ωr + 5*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) - 
3.47*(3*Ωr + 6*Ωθ + 3*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) - 
2.05*(Ωr + 4*Ωϕ)^4*sin(t*(Ωr + 4*Ωϕ)) + 
2.4*(2*Ωr + 4*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωϕ)) - 
2.91*(3*Ωr + 4*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωϕ)) - 
1.87*(Ωθ + 4*Ωϕ)^4*sin(t*(Ωθ + 4*Ωϕ)) + 
2.1*(Ωr + Ωθ + 4*Ωϕ)^4*sin(t*(Ωr + Ωθ + 4*Ωϕ)) + 
2.46*(2*Ωr + Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωr + Ωθ + 4*Ωϕ)) + 
2.98*(3*Ωr + Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 4*Ωϕ)) + 
1.92*(2*Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωθ + 4*Ωϕ)) + 
2.16*(Ωr + 2*Ωθ + 4*Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + 4*Ωϕ)) - 
2.5300000000000002*(2*Ωr + 2*Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) + 
3.06*(3*Ωr + 2*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) + 
1.98*(3*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωθ + 4*Ωϕ)) - 
2.23*(Ωr + 3*Ωθ + 4*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 4*Ωϕ)) - 
2.61*(2*Ωr + 3*Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) - 
3.15*(3*Ωr + 3*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) - 
2.31*(Ωr + 4*Ωθ + 4*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 4*Ωϕ)) + 
2.7*(2*Ωr + 4*Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) - 
3.25*(3*Ωr + 4*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) + 
2.8000000000000003*(2*Ωr + 5*Ωθ + 4*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) + 
3.36*(3*Ωr + 5*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) + 
3.48*(3*Ωr + 6*Ωθ + 4*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) - 
2.41*(2*Ωr + 5*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωϕ)) + 
2.92*(3*Ωr + 5*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωϕ)) - 
2.11*(Ωr + Ωθ + 5*Ωϕ)^4*sin(t*(Ωr + Ωθ + 5*Ωϕ)) - 
2.47*(2*Ωr + Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωr + Ωθ + 5*Ωϕ)) - 
2.99*(3*Ωr + Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 5*Ωϕ)) - 
1.93*(2*Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωθ + 5*Ωϕ)) - 
2.17*(Ωr + 2*Ωθ + 5*Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + 5*Ωϕ)) + 
2.54*(2*Ωr + 2*Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) - 
3.0700000000000003*(3*Ωr + 2*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) - 
1.99*(3*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωθ + 5*Ωϕ)) + 
2.24*(Ωr + 3*Ωθ + 5*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 5*Ωϕ)) + 
2.62*(2*Ωr + 3*Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) + 
3.16*(3*Ωr + 3*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) + 
2.32*(Ωr + 4*Ωθ + 5*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 5*Ωϕ)) - 
2.71*(2*Ωr + 4*Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) + 
3.2600000000000002*(3*Ωr + 4*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) - 
2.81*(2*Ωr + 5*Ωθ + 5*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) - 
3.37*(3*Ωr + 5*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) - 
3.49*(3*Ωr + 6*Ωθ + 5*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) - 
2.93*(3*Ωr + 6*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωϕ)) + 
2.48*(2*Ωr + Ωθ + 6*Ωϕ)^4*sin(t*(2*Ωr + Ωθ + 6*Ωϕ)) + 
3.0*(3*Ωr + Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 6*Ωϕ)) + 
2.18*(Ωr + 2*Ωθ + 6*Ωϕ)^4*sin(t*(Ωr + 2*Ωθ + 6*Ωϕ)) - 
2.5500000000000003*(2*Ωr + 2*Ωθ + 6*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) + 
3.08*(3*Ωr + 2*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) + 
2.0*(3*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωθ + 6*Ωϕ)) - 
2.25*(Ωr + 3*Ωθ + 6*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 6*Ωϕ)) - 
2.63*(2*Ωr + 3*Ωθ + 6*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) - 
3.17*(3*Ωr + 3*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) - 
2.33*(Ωr + 4*Ωθ + 6*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 6*Ωϕ)) + 
2.72*(2*Ωr + 4*Ωθ + 6*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) - 
3.27*(3*Ωr + 4*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) + 
2.82*(2*Ωr + 5*Ωθ + 6*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) + 
3.38*(3*Ωr + 5*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) + 
3.5*(3*Ωr + 6*Ωθ + 6*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) - 
3.0100000000000002*(3*Ωr + Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + Ωθ + 7*Ωϕ)) + 
2.56*(2*Ωr + 2*Ωθ + 7*Ωϕ)^4*sin(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) - 
3.09*(3*Ωr + 2*Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) + 
2.2600000000000002*(Ωr + 3*Ωθ + 7*Ωϕ)^4*sin(t*(Ωr + 3*Ωθ + 7*Ωϕ)) + 
2.64*(2*Ωr + 3*Ωθ + 7*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) + 
3.18*(3*Ωr + 3*Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) + 
2.34*(Ωr + 4*Ωθ + 7*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 7*Ωϕ)) - 
2.73*(2*Ωr + 4*Ωθ + 7*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) + 
3.2800000000000002*(3*Ωr + 4*Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) - 
2.83*(2*Ωr + 5*Ωθ + 7*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) - 
3.39*(3*Ωr + 5*Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) - 
3.5100000000000002*(3*Ωr + 6*Ωθ + 7*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) + 
3.1*(3*Ωr + 2*Ωθ + 8*Ωϕ)^4*sin(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) - 
2.65*(2*Ωr + 3*Ωθ + 8*Ωϕ)^4*sin(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) - 
3.19*(3*Ωr + 3*Ωθ + 8*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) - 
2.35*(Ωr + 4*Ωθ + 8*Ωϕ)^4*sin(t*(Ωr + 4*Ωθ + 8*Ωϕ)) + 
2.74*(2*Ωr + 4*Ωθ + 8*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) - 
3.29*(3*Ωr + 4*Ωθ + 8*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) + 
2.84*(2*Ωr + 5*Ωθ + 8*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) + 
3.4*(3*Ωr + 5*Ωθ + 8*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) + 
3.52*(3*Ωr + 6*Ωθ + 8*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) + 
3.2*(3*Ωr + 3*Ωθ + 9*Ωϕ)^4*sin(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) - 
2.75*(2*Ωr + 4*Ωθ + 9*Ωϕ)^4*sin(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) + 
3.3000000000000003*(3*Ωr + 4*Ωθ + 9*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) - 
2.85*(2*Ωr + 5*Ωθ + 9*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) - 
3.41*(3*Ωr + 5*Ωθ + 9*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) - 
3.5300000000000002*(3*Ωr + 6*Ωθ + 9*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) - 
3.31*(3*Ωr + 4*Ωθ + 10*Ωϕ)^4*sin(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) + 
2.86*(2*Ωr + 5*Ωθ + 10*Ωϕ)^4*sin(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) + 
3.42*(3*Ωr + 5*Ωθ + 10*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) + 
3.54*(3*Ωr + 6*Ωθ + 10*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) - 
3.43*(3*Ωr + 5*Ωθ + 11*Ωϕ)^4*sin(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) - 
3.5500000000000003*(3*Ωr + 6*Ωθ + 11*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) + 
3.56*(3*Ωr + 6*Ωθ + 12*Ωϕ)^4*sin(t*(3*Ωr + 6*Ωθ + 12*Ωϕ))

f6(t::Float64, Ωr::Float64, Ωθ::Float64, Ωϕ::Float64)=        0.23*Ωr^6*cos(t*Ωr) - 37.12*Ωr^6*cos(2*t*Ωr) + 794.61*Ωr^6*cos(3*t*Ωr) + 
0.05*Ωθ^6*cos(t*Ωθ) - 6.4*Ωθ^6*cos(2*t*Ωθ) - 116.64*Ωθ^6*cos(3*t*Ωθ) - 
0.28*(Ωr + Ωθ)^6*cos(t*(Ωr + Ωθ)) - 0.64*(2*Ωr + Ωθ)^6*cos(t*(2*Ωr + Ωθ)) - 
1.16*(3*Ωr + Ωθ)^6*cos(t*(3*Ωr + Ωθ)) - 
0.34*(Ωr + 2*Ωθ)^6*cos(t*(Ωr + 2*Ωθ)) + 
0.71*(2*Ωr + 2*Ωθ)^6*cos(t*(2*Ωr + 2*Ωθ)) - 
1.24*(3*Ωr + 2*Ωθ)^6*cos(t*(3*Ωr + 2*Ωθ)) + 
0.41000000000000003*(Ωr + 3*Ωθ)^6*cos(t*(Ωr + 3*Ωθ)) + 
0.79*(2*Ωr + 3*Ωθ)^6*cos(t*(2*Ωr + 3*Ωθ)) + 
1.33*(3*Ωr + 3*Ωθ)^6*cos(t*(3*Ωr + 3*Ωθ)) + 
0.49*(Ωr + 4*Ωθ)^6*cos(t*(Ωr + 4*Ωθ)) - 
0.88*(2*Ωr + 4*Ωθ)^6*cos(t*(2*Ωr + 4*Ωθ)) + 
1.43*(3*Ωr + 4*Ωθ)^6*cos(t*(3*Ωr + 4*Ωθ)) - 
0.98*(2*Ωr + 5*Ωθ)^6*cos(t*(2*Ωr + 5*Ωθ)) - 
1.54*(3*Ωr + 5*Ωθ)^6*cos(t*(3*Ωr + 5*Ωθ)) - 
1.6600000000000001*(3*Ωr + 6*Ωθ)^6*cos(t*(3*Ωr + 6*Ωθ)) - 
0.02*Ωϕ^6*cos(t*Ωϕ) + 1.92*Ωϕ^6*cos(2*t*Ωϕ) - 29.16*Ωϕ^6*cos(3*t*Ωϕ) - 
0.24*(Ωr + Ωϕ)^6*cos(t*(Ωr + Ωϕ)) + 0.59*(2*Ωr + Ωϕ)^6*cos(t*(2*Ωr + Ωϕ)) - 
1.1*(3*Ωr + Ωϕ)^6*cos(t*(3*Ωr + Ωϕ)) - 0.06*(Ωθ + Ωϕ)^6*cos(t*(Ωθ + Ωϕ)) + 
0.29*(Ωr + Ωθ + Ωϕ)^6*cos(t*(Ωr + Ωθ + Ωϕ)) + 
0.65*(2*Ωr + Ωθ + Ωϕ)^6*cos(t*(2*Ωr + Ωθ + Ωϕ)) + 
1.17*(3*Ωr + Ωθ + Ωϕ)^6*cos(t*(3*Ωr + Ωθ + Ωϕ)) + 
0.11*(2*Ωθ + Ωϕ)^6*cos(t*(2*Ωθ + Ωϕ)) + 
0.35000000000000003*(Ωr + 2*Ωθ + Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + Ωϕ)) - 
0.72*(2*Ωr + 2*Ωθ + Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + Ωϕ)) + 
1.25*(3*Ωr + 2*Ωθ + Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + Ωϕ)) + 
0.17*(3*Ωθ + Ωϕ)^6*cos(t*(3*Ωθ + Ωϕ)) - 
0.42*(Ωr + 3*Ωθ + Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + Ωϕ)) - 
0.8*(2*Ωr + 3*Ωθ + Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + Ωϕ)) - 
1.34*(3*Ωr + 3*Ωθ + Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + Ωϕ)) - 
0.5*(Ωr + 4*Ωθ + Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + Ωϕ)) + 
0.89*(2*Ωr + 4*Ωθ + Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + Ωϕ)) - 
1.44*(3*Ωr + 4*Ωθ + Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + Ωϕ)) + 
0.99*(2*Ωr + 5*Ωθ + Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + Ωϕ)) + 
1.55*(3*Ωr + 5*Ωθ + Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + Ωϕ)) + 
1.67*(3*Ωr + 6*Ωθ + Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + Ωϕ)) + 
0.25*(Ωr + 2*Ωϕ)^6*cos(t*(Ωr + 2*Ωϕ)) - 
0.6*(2*Ωr + 2*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωϕ)) + 
1.11*(3*Ωr + 2*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωϕ)) + 
0.07*(Ωθ + 2*Ωϕ)^6*cos(t*(Ωθ + 2*Ωϕ)) - 
0.3*(Ωr + Ωθ + 2*Ωϕ)^6*cos(t*(Ωr + Ωθ + 2*Ωϕ)) - 
0.66*(2*Ωr + Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωr + Ωθ + 2*Ωϕ)) - 
1.18*(3*Ωr + Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 2*Ωϕ)) - 
0.12*(2*Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωθ + 2*Ωϕ)) - 
0.36*(Ωr + 2*Ωθ + 2*Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + 2*Ωϕ)) + 
0.73*(2*Ωr + 2*Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) - 
1.26*(3*Ωr + 2*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) - 
0.18*(3*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωθ + 2*Ωϕ)) + 
0.43*(Ωr + 3*Ωθ + 2*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 2*Ωϕ)) + 
0.81*(2*Ωr + 3*Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) + 
1.35*(3*Ωr + 3*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) + 
0.51*(Ωr + 4*Ωθ + 2*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 2*Ωϕ)) - 
0.9*(2*Ωr + 4*Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) + 
1.45*(3*Ωr + 4*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) - 
1.0*(2*Ωr + 5*Ωθ + 2*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) - 
1.56*(3*Ωr + 5*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) - 
1.68*(3*Ωr + 6*Ωθ + 2*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) - 
0.26*(Ωr + 3*Ωϕ)^6*cos(t*(Ωr + 3*Ωϕ)) + 
0.61*(2*Ωr + 3*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωϕ)) - 
1.12*(3*Ωr + 3*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωϕ)) - 
0.08*(Ωθ + 3*Ωϕ)^6*cos(t*(Ωθ + 3*Ωϕ)) + 
0.31*(Ωr + Ωθ + 3*Ωϕ)^6*cos(t*(Ωr + Ωθ + 3*Ωϕ)) + 
0.67*(2*Ωr + Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωr + Ωθ + 3*Ωϕ)) + 
1.19*(3*Ωr + Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 3*Ωϕ)) + 
0.13*(2*Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωθ + 3*Ωϕ)) + 
0.37*(Ωr + 2*Ωθ + 3*Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + 3*Ωϕ)) - 
0.74*(2*Ωr + 2*Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) + 
1.27*(3*Ωr + 2*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) + 
0.19*(3*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωθ + 3*Ωϕ)) - 
0.44*(Ωr + 3*Ωθ + 3*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 3*Ωϕ)) - 
0.8200000000000001*(2*Ωr + 3*Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) - 
1.36*(3*Ωr + 3*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) - 
0.52*(Ωr + 4*Ωθ + 3*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 3*Ωϕ)) + 
0.91*(2*Ωr + 4*Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) - 
1.46*(3*Ωr + 4*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) + 
1.01*(2*Ωr + 5*Ωθ + 3*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) + 
1.57*(3*Ωr + 5*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) + 
1.69*(3*Ωr + 6*Ωθ + 3*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) + 
0.27*(Ωr + 4*Ωϕ)^6*cos(t*(Ωr + 4*Ωϕ)) - 
0.62*(2*Ωr + 4*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωϕ)) + 
1.1300000000000001*(3*Ωr + 4*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωϕ)) + 
0.09*(Ωθ + 4*Ωϕ)^6*cos(t*(Ωθ + 4*Ωϕ)) - 
0.32*(Ωr + Ωθ + 4*Ωϕ)^6*cos(t*(Ωr + Ωθ + 4*Ωϕ)) - 
0.68*(2*Ωr + Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωr + Ωθ + 4*Ωϕ)) - 
1.2*(3*Ωr + Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 4*Ωϕ)) - 
0.14*(2*Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωθ + 4*Ωϕ)) - 
0.38*(Ωr + 2*Ωθ + 4*Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + 4*Ωϕ)) + 
0.75*(2*Ωr + 2*Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) - 
1.28*(3*Ωr + 2*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) - 
0.2*(3*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωθ + 4*Ωϕ)) + 
0.45*(Ωr + 3*Ωθ + 4*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 4*Ωϕ)) + 
0.8300000000000001*(2*Ωr + 3*Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) + 
1.37*(3*Ωr + 3*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) + 
0.53*(Ωr + 4*Ωθ + 4*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 4*Ωϕ)) - 
0.92*(2*Ωr + 4*Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) + 
1.47*(3*Ωr + 4*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) - 
1.02*(2*Ωr + 5*Ωθ + 4*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) - 
1.58*(3*Ωr + 5*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) - 
1.7*(3*Ωr + 6*Ωθ + 4*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) + 
0.63*(2*Ωr + 5*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωϕ)) - 
1.1400000000000001*(3*Ωr + 5*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωϕ)) + 
0.33*(Ωr + Ωθ + 5*Ωϕ)^6*cos(t*(Ωr + Ωθ + 5*Ωϕ)) + 
0.6900000000000001*(2*Ωr + Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωr + Ωθ + 5*Ωϕ)) + 
1.21*(3*Ωr + Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 5*Ωϕ)) + 
0.15*(2*Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωθ + 5*Ωϕ)) + 
0.39*(Ωr + 2*Ωθ + 5*Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + 5*Ωϕ)) - 
0.76*(2*Ωr + 2*Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) + 
1.29*(3*Ωr + 2*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) + 
0.21*(3*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωθ + 5*Ωϕ)) - 
0.46*(Ωr + 3*Ωθ + 5*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 5*Ωϕ)) - 
0.84*(2*Ωr + 3*Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) - 
1.3800000000000001*(3*Ωr + 3*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) - 
0.54*(Ωr + 4*Ωθ + 5*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 5*Ωϕ)) + 
0.93*(2*Ωr + 4*Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) - 
1.48*(3*Ωr + 4*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) + 
1.03*(2*Ωr + 5*Ωθ + 5*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) + 
1.59*(3*Ωr + 5*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) + 
1.71*(3*Ωr + 6*Ωθ + 5*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) + 
1.1500000000000001*(3*Ωr + 6*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωϕ)) - 
0.7000000000000001*(2*Ωr + Ωθ + 6*Ωϕ)^6*cos(t*(2*Ωr + Ωθ + 6*Ωϕ)) - 
1.22*(3*Ωr + Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 6*Ωϕ)) - 
0.4*(Ωr + 2*Ωθ + 6*Ωϕ)^6*cos(t*(Ωr + 2*Ωθ + 6*Ωϕ)) + 
0.77*(2*Ωr + 2*Ωθ + 6*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) - 
1.3*(3*Ωr + 2*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) - 
0.22*(3*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωθ + 6*Ωϕ)) + 
0.47000000000000003*(Ωr + 3*Ωθ + 6*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 6*Ωϕ)) + 
0.85*(2*Ωr + 3*Ωθ + 6*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) + 
1.3900000000000001*(3*Ωr + 3*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) + 
0.55*(Ωr + 4*Ωθ + 6*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 6*Ωϕ)) - 
0.9400000000000001*(2*Ωr + 4*Ωθ + 6*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) + 
1.49*(3*Ωr + 4*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) - 
1.04*(2*Ωr + 5*Ωθ + 6*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) - 
1.6*(3*Ωr + 5*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) - 
1.72*(3*Ωr + 6*Ωθ + 6*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) + 
1.23*(3*Ωr + Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + Ωθ + 7*Ωϕ)) - 
0.78*(2*Ωr + 2*Ωθ + 7*Ωϕ)^6*cos(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) + 
1.31*(3*Ωr + 2*Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) - 
0.48*(Ωr + 3*Ωθ + 7*Ωϕ)^6*cos(t*(Ωr + 3*Ωθ + 7*Ωϕ)) - 
0.86*(2*Ωr + 3*Ωθ + 7*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) - 
1.4000000000000001*(3*Ωr + 3*Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) - 
0.56*(Ωr + 4*Ωθ + 7*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 7*Ωϕ)) + 
0.9500000000000001*(2*Ωr + 4*Ωθ + 7*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) - 
1.5*(3*Ωr + 4*Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) + 
1.05*(2*Ωr + 5*Ωθ + 7*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) + 
1.61*(3*Ωr + 5*Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) + 
1.73*(3*Ωr + 6*Ωθ + 7*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) - 
1.32*(3*Ωr + 2*Ωθ + 8*Ωϕ)^6*cos(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) + 
0.87*(2*Ωr + 3*Ωθ + 8*Ωϕ)^6*cos(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) + 
1.41*(3*Ωr + 3*Ωθ + 8*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) + 
0.5700000000000001*(Ωr + 4*Ωθ + 8*Ωϕ)^6*cos(t*(Ωr + 4*Ωθ + 8*Ωϕ)) - 
0.96*(2*Ωr + 4*Ωθ + 8*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) + 
1.51*(3*Ωr + 4*Ωθ + 8*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) - 
1.06*(2*Ωr + 5*Ωθ + 8*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) - 
1.62*(3*Ωr + 5*Ωθ + 8*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) - 
1.74*(3*Ωr + 6*Ωθ + 8*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) - 
1.42*(3*Ωr + 3*Ωθ + 9*Ωϕ)^6*cos(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) + 
0.97*(2*Ωr + 4*Ωθ + 9*Ωϕ)^6*cos(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) - 
1.52*(3*Ωr + 4*Ωθ + 9*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) + 
1.07*(2*Ωr + 5*Ωθ + 9*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) + 
1.6300000000000001*(3*Ωr + 5*Ωθ + 9*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) + 
1.75*(3*Ωr + 6*Ωθ + 9*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) + 
1.53*(3*Ωr + 4*Ωθ + 10*Ωϕ)^6*cos(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) - 
1.08*(2*Ωr + 5*Ωθ + 10*Ωϕ)^6*cos(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) - 
1.6400000000000001*(3*Ωr + 5*Ωθ + 10*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) - 
1.76*(3*Ωr + 6*Ωθ + 10*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) + 
1.6500000000000001*(3*Ωr + 5*Ωθ + 11*Ωϕ)^6*cos(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) + 
1.77*(3*Ωr + 6*Ωθ + 11*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) - 
1.78*(3*Ωr + 6*Ωθ + 12*Ωϕ)^6*cos(t*(3*Ωr + 6*Ωθ + 12*Ωϕ)) + 
2.0100000000000002*Ωr^6*sin(t*Ωr) - 151.04*Ωr^6*sin(2*t*Ωr) + 
2092.23*Ωr^6*sin(3*t*Ωr) + 1.83*Ωθ^6*sin(t*Ωθ) - 
120.32000000000001*Ωθ^6*sin(2*t*Ωθ) - 1414.26*Ωθ^6*sin(3*t*Ωθ) - 
2.06*(Ωr + Ωθ)^6*sin(t*(Ωr + Ωθ)) - 2.42*(2*Ωr + Ωθ)^6*sin(t*(2*Ωr + Ωθ)) - 
2.94*(3*Ωr + Ωθ)^6*sin(t*(3*Ωr + Ωθ)) - 
2.12*(Ωr + 2*Ωθ)^6*sin(t*(Ωr + 2*Ωθ)) + 
2.49*(2*Ωr + 2*Ωθ)^6*sin(t*(2*Ωr + 2*Ωθ)) - 
3.02*(3*Ωr + 2*Ωθ)^6*sin(t*(3*Ωr + 2*Ωθ)) + 
2.19*(Ωr + 3*Ωθ)^6*sin(t*(Ωr + 3*Ωθ)) + 
2.57*(2*Ωr + 3*Ωθ)^6*sin(t*(2*Ωr + 3*Ωθ)) + 
3.11*(3*Ωr + 3*Ωθ)^6*sin(t*(3*Ωr + 3*Ωθ)) + 
2.27*(Ωr + 4*Ωθ)^6*sin(t*(Ωr + 4*Ωθ)) - 
2.66*(2*Ωr + 4*Ωθ)^6*sin(t*(2*Ωr + 4*Ωθ)) + 
3.21*(3*Ωr + 4*Ωθ)^6*sin(t*(3*Ωr + 4*Ωθ)) - 
2.7600000000000002*(2*Ωr + 5*Ωθ)^6*sin(t*(2*Ωr + 5*Ωθ)) - 
3.3200000000000003*(3*Ωr + 5*Ωθ)^6*sin(t*(3*Ωr + 5*Ωθ)) - 
3.44*(3*Ωr + 6*Ωθ)^6*sin(t*(3*Ωr + 6*Ωθ)) - 1.8*Ωϕ^6*sin(t*Ωϕ) + 
115.84*Ωϕ^6*sin(2*t*Ωϕ) - 1326.78*Ωϕ^6*sin(3*t*Ωϕ) - 
2.02*(Ωr + Ωϕ)^6*sin(t*(Ωr + Ωϕ)) + 2.37*(2*Ωr + Ωϕ)^6*sin(t*(2*Ωr + Ωϕ)) - 
2.88*(3*Ωr + Ωϕ)^6*sin(t*(3*Ωr + Ωϕ)) - 1.84*(Ωθ + Ωϕ)^6*sin(t*(Ωθ + Ωϕ)) + 
2.07*(Ωr + Ωθ + Ωϕ)^6*sin(t*(Ωr + Ωθ + Ωϕ)) + 
2.43*(2*Ωr + Ωθ + Ωϕ)^6*sin(t*(2*Ωr + Ωθ + Ωϕ)) + 
2.95*(3*Ωr + Ωθ + Ωϕ)^6*sin(t*(3*Ωr + Ωθ + Ωϕ)) + 
1.8900000000000001*(2*Ωθ + Ωϕ)^6*sin(t*(2*Ωθ + Ωϕ)) + 
2.13*(Ωr + 2*Ωθ + Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + Ωϕ)) - 
2.5*(2*Ωr + 2*Ωθ + Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + Ωϕ)) + 
3.0300000000000002*(3*Ωr + 2*Ωθ + Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + Ωϕ)) + 
1.95*(3*Ωθ + Ωϕ)^6*sin(t*(3*Ωθ + Ωϕ)) - 
2.2*(Ωr + 3*Ωθ + Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + Ωϕ)) - 
2.58*(2*Ωr + 3*Ωθ + Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + Ωϕ)) - 
3.12*(3*Ωr + 3*Ωθ + Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + Ωϕ)) - 
2.2800000000000002*(Ωr + 4*Ωθ + Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + Ωϕ)) + 
2.67*(2*Ωr + 4*Ωθ + Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + Ωϕ)) - 
3.22*(3*Ωr + 4*Ωθ + Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + Ωϕ)) + 
2.77*(2*Ωr + 5*Ωθ + Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + Ωϕ)) + 
3.33*(3*Ωr + 5*Ωθ + Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + Ωϕ)) + 
3.45*(3*Ωr + 6*Ωθ + Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + Ωϕ)) + 
2.0300000000000002*(Ωr + 2*Ωϕ)^6*sin(t*(Ωr + 2*Ωϕ)) - 
2.38*(2*Ωr + 2*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωϕ)) + 
2.89*(3*Ωr + 2*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωϕ)) + 
1.85*(Ωθ + 2*Ωϕ)^6*sin(t*(Ωθ + 2*Ωϕ)) - 
2.08*(Ωr + Ωθ + 2*Ωϕ)^6*sin(t*(Ωr + Ωθ + 2*Ωϕ)) - 
2.44*(2*Ωr + Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωr + Ωθ + 2*Ωϕ)) - 
2.96*(3*Ωr + Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 2*Ωϕ)) - 
1.9000000000000001*(2*Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωθ + 2*Ωϕ)) - 
2.14*(Ωr + 2*Ωθ + 2*Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + 2*Ωϕ)) + 
2.5100000000000002*(2*Ωr + 2*Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 2*Ωϕ)) - 
3.04*(3*Ωr + 2*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 2*Ωϕ)) - 
1.96*(3*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωθ + 2*Ωϕ)) + 
2.21*(Ωr + 3*Ωθ + 2*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 2*Ωϕ)) + 
2.59*(2*Ωr + 3*Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 2*Ωϕ)) + 
3.13*(3*Ωr + 3*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 2*Ωϕ)) + 
2.29*(Ωr + 4*Ωθ + 2*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 2*Ωϕ)) - 
2.68*(2*Ωr + 4*Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 2*Ωϕ)) + 
3.23*(3*Ωr + 4*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 2*Ωϕ)) - 
2.7800000000000002*(2*Ωr + 5*Ωθ + 2*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 2*Ωϕ)) - 
3.34*(3*Ωr + 5*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 2*Ωϕ)) - 
3.46*(3*Ωr + 6*Ωθ + 2*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 2*Ωϕ)) - 
2.04*(Ωr + 3*Ωϕ)^6*sin(t*(Ωr + 3*Ωϕ)) + 
2.39*(2*Ωr + 3*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωϕ)) - 
2.9*(3*Ωr + 3*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωϕ)) - 
1.86*(Ωθ + 3*Ωϕ)^6*sin(t*(Ωθ + 3*Ωϕ)) + 
2.09*(Ωr + Ωθ + 3*Ωϕ)^6*sin(t*(Ωr + Ωθ + 3*Ωϕ)) + 
2.45*(2*Ωr + Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωr + Ωθ + 3*Ωϕ)) + 
2.97*(3*Ωr + Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 3*Ωϕ)) + 
1.9100000000000001*(2*Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωθ + 3*Ωϕ)) + 
2.15*(Ωr + 2*Ωθ + 3*Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + 3*Ωϕ)) - 
2.52*(2*Ωr + 2*Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 3*Ωϕ)) + 
3.0500000000000003*(3*Ωr + 2*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 3*Ωϕ)) + 
1.97*(3*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωθ + 3*Ωϕ)) - 
2.22*(Ωr + 3*Ωθ + 3*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 3*Ωϕ)) - 
2.6*(2*Ωr + 3*Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 3*Ωϕ)) - 
3.14*(3*Ωr + 3*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 3*Ωϕ)) - 
2.3000000000000003*(Ωr + 4*Ωθ + 3*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 3*Ωϕ)) + 
2.69*(2*Ωr + 4*Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 3*Ωϕ)) - 
3.24*(3*Ωr + 4*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 3*Ωϕ)) + 
2.79*(2*Ωr + 5*Ωθ + 3*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 3*Ωϕ)) + 
3.35*(3*Ωr + 5*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 3*Ωϕ)) + 
3.47*(3*Ωr + 6*Ωθ + 3*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 3*Ωϕ)) + 
2.05*(Ωr + 4*Ωϕ)^6*sin(t*(Ωr + 4*Ωϕ)) - 
2.4*(2*Ωr + 4*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωϕ)) + 
2.91*(3*Ωr + 4*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωϕ)) + 
1.87*(Ωθ + 4*Ωϕ)^6*sin(t*(Ωθ + 4*Ωϕ)) - 
2.1*(Ωr + Ωθ + 4*Ωϕ)^6*sin(t*(Ωr + Ωθ + 4*Ωϕ)) - 
2.46*(2*Ωr + Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωr + Ωθ + 4*Ωϕ)) - 
2.98*(3*Ωr + Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 4*Ωϕ)) - 
1.92*(2*Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωθ + 4*Ωϕ)) - 
2.16*(Ωr + 2*Ωθ + 4*Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + 4*Ωϕ)) + 
2.5300000000000002*(2*Ωr + 2*Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 4*Ωϕ)) - 
3.06*(3*Ωr + 2*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 4*Ωϕ)) - 
1.98*(3*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωθ + 4*Ωϕ)) + 
2.23*(Ωr + 3*Ωθ + 4*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 4*Ωϕ)) + 
2.61*(2*Ωr + 3*Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 4*Ωϕ)) + 
3.15*(3*Ωr + 3*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 4*Ωϕ)) + 
2.31*(Ωr + 4*Ωθ + 4*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 4*Ωϕ)) - 
2.7*(2*Ωr + 4*Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 4*Ωϕ)) + 
3.25*(3*Ωr + 4*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 4*Ωϕ)) - 
2.8000000000000003*(2*Ωr + 5*Ωθ + 4*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 4*Ωϕ)) - 
3.36*(3*Ωr + 5*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 4*Ωϕ)) - 
3.48*(3*Ωr + 6*Ωθ + 4*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 4*Ωϕ)) + 
2.41*(2*Ωr + 5*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωϕ)) - 
2.92*(3*Ωr + 5*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωϕ)) + 
2.11*(Ωr + Ωθ + 5*Ωϕ)^6*sin(t*(Ωr + Ωθ + 5*Ωϕ)) + 
2.47*(2*Ωr + Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωr + Ωθ + 5*Ωϕ)) + 
2.99*(3*Ωr + Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 5*Ωϕ)) + 
1.93*(2*Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωθ + 5*Ωϕ)) + 
2.17*(Ωr + 2*Ωθ + 5*Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + 5*Ωϕ)) - 
2.54*(2*Ωr + 2*Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 5*Ωϕ)) + 
3.0700000000000003*(3*Ωr + 2*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 5*Ωϕ)) + 
1.99*(3*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωθ + 5*Ωϕ)) - 
2.24*(Ωr + 3*Ωθ + 5*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 5*Ωϕ)) - 
2.62*(2*Ωr + 3*Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 5*Ωϕ)) - 
3.16*(3*Ωr + 3*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 5*Ωϕ)) - 
2.32*(Ωr + 4*Ωθ + 5*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 5*Ωϕ)) + 
2.71*(2*Ωr + 4*Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 5*Ωϕ)) - 
3.2600000000000002*(3*Ωr + 4*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 5*Ωϕ)) + 
2.81*(2*Ωr + 5*Ωθ + 5*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 5*Ωϕ)) + 
3.37*(3*Ωr + 5*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 5*Ωϕ)) + 
3.49*(3*Ωr + 6*Ωθ + 5*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 5*Ωϕ)) + 
2.93*(3*Ωr + 6*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωϕ)) - 
2.48*(2*Ωr + Ωθ + 6*Ωϕ)^6*sin(t*(2*Ωr + Ωθ + 6*Ωϕ)) - 
3.0*(3*Ωr + Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 6*Ωϕ)) - 
2.18*(Ωr + 2*Ωθ + 6*Ωϕ)^6*sin(t*(Ωr + 2*Ωθ + 6*Ωϕ)) + 
2.5500000000000003*(2*Ωr + 2*Ωθ + 6*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 6*Ωϕ)) - 
3.08*(3*Ωr + 2*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 6*Ωϕ)) - 
2.0*(3*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωθ + 6*Ωϕ)) + 
2.25*(Ωr + 3*Ωθ + 6*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 6*Ωϕ)) + 
2.63*(2*Ωr + 3*Ωθ + 6*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 6*Ωϕ)) + 
3.17*(3*Ωr + 3*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 6*Ωϕ)) + 
2.33*(Ωr + 4*Ωθ + 6*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 6*Ωϕ)) - 
2.72*(2*Ωr + 4*Ωθ + 6*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 6*Ωϕ)) + 
3.27*(3*Ωr + 4*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 6*Ωϕ)) - 
2.82*(2*Ωr + 5*Ωθ + 6*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 6*Ωϕ)) - 
3.38*(3*Ωr + 5*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 6*Ωϕ)) - 
3.5*(3*Ωr + 6*Ωθ + 6*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 6*Ωϕ)) + 
3.0100000000000002*(3*Ωr + Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + Ωθ + 7*Ωϕ)) - 
2.56*(2*Ωr + 2*Ωθ + 7*Ωϕ)^6*sin(t*(2*Ωr + 2*Ωθ + 7*Ωϕ)) + 
3.09*(3*Ωr + 2*Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 7*Ωϕ)) - 
2.2600000000000002*(Ωr + 3*Ωθ + 7*Ωϕ)^6*sin(t*(Ωr + 3*Ωθ + 7*Ωϕ)) - 
2.64*(2*Ωr + 3*Ωθ + 7*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 7*Ωϕ)) - 
3.18*(3*Ωr + 3*Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 7*Ωϕ)) - 
2.34*(Ωr + 4*Ωθ + 7*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 7*Ωϕ)) + 
2.73*(2*Ωr + 4*Ωθ + 7*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 7*Ωϕ)) - 
3.2800000000000002*(3*Ωr + 4*Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 7*Ωϕ)) + 
2.83*(2*Ωr + 5*Ωθ + 7*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 7*Ωϕ)) + 
3.39*(3*Ωr + 5*Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 7*Ωϕ)) + 
3.5100000000000002*(3*Ωr + 6*Ωθ + 7*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 7*Ωϕ)) - 
3.1*(3*Ωr + 2*Ωθ + 8*Ωϕ)^6*sin(t*(3*Ωr + 2*Ωθ + 8*Ωϕ)) + 
2.65*(2*Ωr + 3*Ωθ + 8*Ωϕ)^6*sin(t*(2*Ωr + 3*Ωθ + 8*Ωϕ)) + 
3.19*(3*Ωr + 3*Ωθ + 8*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 8*Ωϕ)) + 
2.35*(Ωr + 4*Ωθ + 8*Ωϕ)^6*sin(t*(Ωr + 4*Ωθ + 8*Ωϕ)) - 
2.74*(2*Ωr + 4*Ωθ + 8*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 8*Ωϕ)) + 
3.29*(3*Ωr + 4*Ωθ + 8*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 8*Ωϕ)) - 
2.84*(2*Ωr + 5*Ωθ + 8*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 8*Ωϕ)) - 
3.4*(3*Ωr + 5*Ωθ + 8*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 8*Ωϕ)) - 
3.52*(3*Ωr + 6*Ωθ + 8*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 8*Ωϕ)) - 
3.2*(3*Ωr + 3*Ωθ + 9*Ωϕ)^6*sin(t*(3*Ωr + 3*Ωθ + 9*Ωϕ)) + 
2.75*(2*Ωr + 4*Ωθ + 9*Ωϕ)^6*sin(t*(2*Ωr + 4*Ωθ + 9*Ωϕ)) - 
3.3000000000000003*(3*Ωr + 4*Ωθ + 9*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 9*Ωϕ)) + 
2.85*(2*Ωr + 5*Ωθ + 9*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 9*Ωϕ)) + 
3.41*(3*Ωr + 5*Ωθ + 9*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 9*Ωϕ)) + 
3.5300000000000002*(3*Ωr + 6*Ωθ + 9*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 9*Ωϕ)) + 
3.31*(3*Ωr + 4*Ωθ + 10*Ωϕ)^6*sin(t*(3*Ωr + 4*Ωθ + 10*Ωϕ)) - 
2.86*(2*Ωr + 5*Ωθ + 10*Ωϕ)^6*sin(t*(2*Ωr + 5*Ωθ + 10*Ωϕ)) - 
3.42*(3*Ωr + 5*Ωθ + 10*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 10*Ωϕ)) - 
3.54*(3*Ωr + 6*Ωθ + 10*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 10*Ωϕ)) + 
3.43*(3*Ωr + 5*Ωθ + 11*Ωϕ)^6*sin(t*(3*Ωr + 5*Ωθ + 11*Ωϕ)) + 
3.5500000000000003*(3*Ωr + 6*Ωθ + 11*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 11*Ωϕ)) - 
3.56*(3*Ωr + 6*Ωθ + 12*Ωϕ)^6*sin(t*(3*Ωr + 6*Ωθ + 12*Ωϕ))
end